"[\n  {\n    \"Control Id\": \"A.5.22\",\n    \"Policy Implementation Evidence\": \"Evidence controls are applied\\\\A.5.22\\\\Vendor risk assesment - Jumpcloud [Internal].docx.pdf\",\n    \"Exact Evidence Extract\": \"Vendor risk assessment dated 19-2-2025 for Jumpcloud includes SLA metrics, quality of deliverables, communication, compliance with regulatory requirements including GDPR, and security posture with ISO27001 and SOC2 certifications. The assessment documents subscription to status pages, MFA implementation, vulnerability assessment, and incident response. The document references contract management and risk assessment processes.\",\n    \"Evidence Recommendation\": \"Include direct evidence of contract clauses specifying information security requirements and ongoing monitoring activities to strengthen linkage to policy.\"\n  },\n  {\n    \"Control Id\": \"A.5.25\",\n    \"Policy Implementation Evidence\": \"Evidence controls are applied\\\\A.5.25\\\\#18- CAPA-form [Confidential] - possible confidential sales data leaked during offboarding of employee .docx.pdf\",\n    \"Exact Evidence Extract\": \"Incident involving an employee sending confidential customer data to an external email address was investigated. Corrective actions included forensic evidence gathering, legal action, and updating the Information Security Policy to clarify rules on personal devices. Preventive actions include staff awareness during townhall meetings.\",\n    \"Evidence Recommendation\": \"Document formal incident response timelines and post-incident review reports to demonstrate continuous improvement and compliance with incident management policy.\"\n  },\n  {\n    \"Control Id\": \"A.5.8\",\n    \"Policy Implementation Evidence\": \"Evidence controls are applied\\\\A.5.8\\\\4.4.1.6.1 System development life cycle [Confidential].pptx.pdf\",\n    \"Exact Evidence Extract\": \"System development life cycle document details testing phases in CI/CD pipeline including unit, integration, performance, vulnerability, and acceptance testing. Branch protection rules require approvals for staging and production merges. Security policies such as code scanning and Dependabot are under investigation.\",\n    \"Evidence Recommendation\": \"Complete documentation of security policy implementation in CI/CD pipeline and evidence of enforcement (e.g., audit logs) would enhance assurance.\"\n  }\n]"