"[\n  {\n    \"Control Id\": \"A.5.22\",\n    \"Policy Implementation Evidence\": \"Evidence controls are applied\\\\A.5.22\\\\Vendor risk assesment - Jumpcloud [Internal].docx.pdf\",\n    \"Exact Evidence Extract\": \"Vendor risk assessment dated 19-2-2025 for Jumpcloud includes SLA metrics, quality of deliverables, communication, compliance with regulatory requirements (GDPR), security posture (ISO27001 and SOC2 certifications, MFA), and summary with goals and KPIs. The assessment is documented and uploaded in ISMS. Contract management is referenced (A3.3.2 Contract Management).\",\n    \"Evidence Recommendation\": \"Enhance documentation by including detailed procedures or examples of contract clauses addressing information security requirements and periodic review processes to fully satisfy control A.5.22.\"\n  },\n  {\n    \"Control Id\": \"A.5.25\",\n    \"Policy Implementation Evidence\": \"Evidence controls are applied\\\\A.5.25\\\\#18- CAPA-form [Confidential] - possible confidential sales data leaked during offboarding of employee .docx.pdf\",\n    \"Exact Evidence Extract\": \"Incident involving data leakage by an offboarding employee was investigated, forensic evidence gathered, lawsuit filed, and CAPA actions taken including policy update to clarify rules on personal devices. Preventive actions include staff awareness during townhall meetings.\",\n    \"Evidence Recommendation\": \"Maintain formal documented post-incident review and continuous improvement process to strengthen learning from incidents.\"\n  },\n  {\n    \"Control Id\": \"A.5.8\",\n    \"Policy Implementation Evidence\": \"Evidence controls are applied\\\\A.5.8\\\\4.4.1.6.1 System development life cycle [Confidential].pptx.pdf\",\n    \"Exact Evidence Extract\": \"System Development Life Cycle (SDLC) document version 1.1 dated 07-03-2023 details testing phases in CI/CD pipeline including unit, integration, vulnerability, performance, and acceptance testing. Branch protection rules require approvals before merging to staging and production. Security policies and code scanning under investigation.\",\n    \"Evidence Recommendation\": \"Continue to develop and finalize security policies related to code scanning and security policy enforcement within SDLC.\"\n  }\n]"