"[\n  {\n    \"Clause\": \"4\",\n    \"Section\": \"A.5 (Organisational Controls)\",\n    \"Control Id\": \"A.5.1\",\n    \"Control Title\": \"Policies for information security\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Information Security Policy document defines baseline control measures, scope, enforcement, roles and responsibilities, and management commitment to information security aligned with ISO 27001 standards.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide updated or additional evidence such as recent policy documents or management statements confirming current policy enforcement.\",\n    \"Gaps Identified\": \"No new evidence of updated or additional information security policies found in the provided text.\",\n    \"Recommended Action\": \"Submit current Information Security Policy documents or management communications to demonstrate ongoing policy enforcement.\"\n  },\n  {\n    \"Clause\": \"4,5\",\n    \"Section\": \"A.5 (Organisational Controls)\",\n    \"Control Id\": \"A.5.2\",\n    \"Control Title\": \"Information security roles and responsibilities\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Roles and responsibilities are clearly defined for CEO, ISSC, Operational Director, ISWG, IT Asset Managers, Managers, Users, Crisis Management Team, Crisis Management Support Team, and Recovery Managers with assigned authorities and accountabilities.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide organizational charts, role descriptions, or documented assignments of information security responsibilities.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding defined roles and responsibilities.\",\n    \"Recommended Action\": \"Submit documentation or evidence showing current assignment and communication of information security roles.\"\n  },\n  {\n    \"Clause\": \"5\",\n    \"Section\": \"A.5 (Organisational Controls)\",\n    \"Control Id\": \"A.5.3\",\n    \"Control Title\": \"Segregation of duties\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Segregation of duties is mandated to reduce risk of misuse; management ensures segregation when assigning responsibilities; where segregation is difficult, compensating controls like monitoring and audit trails are applied.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide documented procedures or audit reports demonstrating segregation of duties implementation.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding segregation of duties.\",\n    \"Recommended Action\": \"Submit evidence such as role assignments, process controls, or audit findings confirming segregation of duties.\"\n  },\n  {\n    \"Clause\": \"5,6,9,10\",\n    \"Section\": \"A.5 (Organisational Controls)\",\n    \"Control Id\": \"A.5.4\",\n    \"Control Title\": \"Management responsibilities\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Management is responsible for setting security objectives, aligning with business strategy, resource allocation, policy enforcement, training, review, and continuous improvement; documented procedures for incident management, change management, and review are in place.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide meeting minutes, management review records, or documented procedures showing management involvement.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding management responsibilities.\",\n    \"Recommended Action\": \"Submit evidence of management reviews, decisions, or documented responsibilities.\"\n  },\n  {\n    \"Clause\": \"\",\n    \"Section\": \"A.5 (Organisational Controls)\",\n    \"Control Id\": \"A.5.5\",\n    \"Control Title\": \"Contact with authorities\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Procedures and contacts for communication with local authorities and emergency services are defined in incident response plans and key contacts appendix.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide incident response plans or contact lists showing communication with authorities.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding contact with authorities.\",\n    \"Recommended Action\": \"Submit documented procedures or contact lists for authorities and emergency services.\"\n  },\n  {\n    \"Clause\": \"\",\n    \"Section\": \"A.5 (Organisational Controls)\",\n    \"Control Id\": \"A.5.6\",\n    \"Control Title\": \"Contact with special interest groups\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"The Information Security Policy mentions receiving security news from external vendors, forums, newsletters, and magazines to stay updated.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Establish and document formal contacts or memberships with relevant special interest groups or information sharing communities.\",\n    \"Gaps Identified\": \"No evidence found in the text of formal contact or membership with special interest groups.\",\n    \"Recommended Action\": \"Develop and document formal relationships with special interest groups to enhance threat intelligence.\"\n  },\n  {\n    \"Clause\": \"6\",\n    \"Section\": \"A.5 (Organisational Controls)\",\n    \"Control Id\": \"A.5.7\",\n    \"Control Title\": \"Threat intelligence\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Organisation maintains subscriptions to vulnerability and virus outbreak notifications and circulates relevant information to responsible teams; regularly receives security news from external sources.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide evidence of subscriptions, distribution lists, or reports on threat intelligence.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding threat intelligence activities.\",\n    \"Recommended Action\": \"Submit documentation showing active threat intelligence gathering and dissemination.\"\n  },\n  {\n    \"Clause\": \"7\",\n    \"Section\": \"A.5 (Organisational Controls)\",\n    \"Control Id\": \"A.5.8\",\n    \"Control Title\": \"Information security in project management\",\n    \"Compliance\": \"✅\",\n    \"Policy\": \"Information security requirements are integrated into project plans and system development lifecycle; security reviews and approvals are part of project governance; external service providers’ SDLC reviewed.\",\n    \"Reference\": \"System development life cycle [Confidential].pptx.pdf - Pages 3-5: Testing in CI/CD pipeline, branch protection rules, pull-request strategy, and code review processes.\",\n    \"Evidence Reference\": \"(Evidence controls are applied\\\\A.5.8\\\\4.4.1.6.1 System development life cycle [Confidential].pptx.pdf)\",\n    \"Implemented Evidence\": \"Documented system development life cycle includes unit, integration, performance, vulnerability, and acceptance testing; branch protection rules require approvals before merging; code reviews are mandatory; security policies under investigation for GitHub security.\",\n    \"Evidence Recommendation\": \"Include formal documented security policy for code repositories and evidence of enforcement of branch protection and code review policies.\",\n    \"Gaps Identified\": \"Security policy for GitHub security is under investigation; no evidence of completed formal security policy for code repositories.\",\n    \"Recommended Action\": \"Finalize and document GitHub security policies and demonstrate enforcement of branch protection and code review.\"\n  },\n  {\n    \"Clause\": \"\",\n    \"Section\": \"A.5 (Organisational Controls)\",\n    \"Control Id\": \"A.5.9\",\n    \"Control Title\": \"Inventory of information and other associated assets\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"IT Asset Managers maintain and periodically update inventory of hardware and software assets including location and assigned users; physical inventory checks performed annually.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide updated asset inventory records or audit reports.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding asset inventory.\",\n    \"Recommended Action\": \"Submit current asset inventory documentation or audit results.\"\n  },\n  {\n    \"Clause\": \"6\",\n    \"Section\": \"A.5 (Organisational Controls)\",\n    \"Control Id\": \"A.5.10\",\n    \"Control Title\": \"Acceptable use of information and other associated assets\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Acceptable use policies for IT, email, and internet are defined; users are responsible for security of their devices and credentials; disciplinary actions for misuse are stated.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide updated acceptable use policies or training records.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding acceptable use policies.\",\n    \"Recommended Action\": \"Submit current acceptable use policies or evidence of user awareness and enforcement.\"\n  },\n  {\n    \"Clause\": \"\",\n    \"Section\": \"A.5 (Organisational Controls)\",\n    \"Control Id\": \"A.5.11\",\n    \"Control Title\": \"Return of assets\",\n    \"Compliance\": \"✅\",\n    \"Policy\": \"Documented procedures require return of company assets (laptops, mobile phones, peripherals) upon termination of employment; access rights revoked on last day.\",\n    \"Reference\": \"CAPA-form [Confidential] - possible confidential sales data leaked during offboarding of employee.docx.pdf - Pages 1-2: Incident involving data leakage during employee offboarding and corrective actions including return of assets and access revocation.\",\n    \"Evidence Reference\": \"(Evidence controls are applied\\\\A.5.25\\\\#18- CAPA-form [Confidential] - possible confidential sales data leaked during offboarding of employee .docx.pdf)\",\n    \"Implemented Evidence\": \"Investigation of data leakage by departing employee included forensic evidence gathering on business laptop and Google account; lawsuit and settlement agreement ensured return and destruction of company information; corrective actions included updating policy on personal device use.\",\n    \"Evidence Recommendation\": \"Include formal documented procedures for asset return and access revocation during termination.\",\n    \"Gaps Identified\": \"No explicit documented procedure included in the evidence, only incident response and corrective actions.\",\n    \"Recommended Action\": \"Document and communicate formal asset return and access revocation procedures.\"\n  },\n  {\n    \"Clause\": \"6\",\n    \"Section\": \"A.5 (Organisational Controls)\",\n    \"Control Id\": \"A.5.12\",\n    \"Control Title\": \"Classification of information\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Information classification schemes are defined based on value, legal requirements, and handling caution; asset owners classify and manage information assets.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide classification scheme documents or examples of classified information.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding information classification.\",\n    \"Recommended Action\": \"Submit documentation of classification schemes and evidence of application.\"\n  },\n  {\n    \"Clause\": \"\",\n    \"Section\": \"A.5 (Organisational Controls)\",\n    \"Control Id\": \"A.5.13\",\n    \"Control Title\": \"Labelling of information\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Information must be labelled and handled according to classification scheme; guidelines for labelling and handling are provided.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide labelling guidelines and examples of labelled information.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding labelling of information.\",\n    \"Recommended Action\": \"Submit labelling procedures and evidence of implementation.\"\n  },\n  {\n    \"Clause\": \"4,8\",\n    \"Section\": \"A.5 (Organisational Controls)\",\n    \"Control Id\": \"A.5.14\",\n    \"Control Title\": \"Information transfer\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Information transfer procedures are defined including secure electronic messaging, approval for external communication, and controls for data sharing; incident response includes communication plans.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide documented procedures for secure information transfer and communication plans.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding information transfer controls.\",\n    \"Recommended Action\": \"Submit procedures and evidence of secure information transfer implementation.\"\n  },\n  {\n    \"Clause\": \"\",\n    \"Section\": \"A.5 (Organisational Controls)\",\n    \"Control Id\": \"A.5.15\",\n    \"Control Title\": \"Access control\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Access control policies and procedures are established including user registration, de-registration, privileged access management, and access reviews; two-factor authentication is mandated where applicable.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide access control policy documents, user access logs, or review reports.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding access control implementation.\",\n    \"Recommended Action\": \"Submit access control policies and evidence of enforcement.\"\n  },\n  {\n    \"Clause\": \"\",\n    \"Section\": \"A.5 (Organisational Controls)\",\n    \"Control Id\": \"A.5.16\",\n    \"Control Title\": \"Identity management\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Formal user registration and de-registration processes are in place; unique user IDs assigned; timely removal of access upon termination; user identity verification before password resets.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide identity management procedures and evidence of user lifecycle management.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding identity management.\",\n    \"Recommended Action\": \"Submit documented identity management processes and evidence of application.\"\n  },\n  {\n    \"Clause\": \"\",\n    \"Section\": \"A.5 (Organisational Controls)\",\n    \"Control Id\": \"A.5.17\",\n    \"Control Title\": \"Authentication information\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Password policies enforce complexity, confidentiality, change requirements, and secure handling; two-factor authentication is required; password sharing is prohibited.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide password policy documents and evidence of enforcement such as system settings or audit logs.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding authentication information controls.\",\n    \"Recommended Action\": \"Submit password policies and evidence of enforcement.\"\n  },\n  {\n    \"Clause\": \"\",\n    \"Section\": \"A.5 (Organisational Controls)\",\n    \"Control Id\": \"A.5.18\",\n    \"Control Title\": \"Access rights\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Access rights are assigned based on business need and least privilege; privileges are reviewed periodically; access revoked promptly upon termination; privileged access is controlled and separated.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide access rights assignment records, review reports, or privileged access management documentation.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding access rights management.\",\n    \"Recommended Action\": \"Submit evidence of access rights assignment and review.\"\n  },\n  {\n    \"Clause\": \"4,8\",\n    \"Section\": \"A.5 (Organisational Controls)\",\n    \"Control Id\": \"A.5.19\",\n    \"Control Title\": \"Information security in supplier relationships\",\n    \"Compliance\": \"✅\",\n    \"Policy\": \"Contracts and SLAs with external service providers are required; credentials and references are verified; NDAs signed; access is authorized and limited; security policies communicated; supplier performance reviewed periodically.\",\n    \"Reference\": \"Vendor risk assessment - Jumpcloud [Internal].docx.pdf - Pages 1-9: Vendor risk assessment including SLA metrics, quality of deliverables, communication, compliance, security posture, and goals & KPIs.\",\n    \"Evidence Reference\": \"(Evidence controls are applied\\\\A.5.22\\\\Vendor risk assesment - Jumpcloud [Internal].docx.pdf)\",\n    \"Implemented Evidence\": \"Vendor risk assessment for Jumpcloud includes evaluation of SLA metrics (uptime, MTTR), quality, communication, compliance with GDPR, security posture with ISO27001 and SOC2 certifications, MFA implementation, and vendor goals/KPIs; assessment dated 19-2-2025 by IT management.\",\n    \"Evidence Recommendation\": \"Include documented contracts, NDAs, and periodic review reports to complement risk assessments.\",\n    \"Gaps Identified\": \"No direct evidence of signed contracts or NDAs included in the document.\",\n    \"Recommended Action\": \"Provide contracts and NDAs to strengthen evidence of supplier relationship controls.\"\n  },\n  {\n    \"Clause\": \"8\",\n    \"Section\": \"A.5 (Organisational Controls)\",\n    \"Control Id\": \"A.5.20\",\n    \"Control Title\": \"Addressing information security within supplier agreements\",\n    \"Compliance\": \"✅\",\n    \"Policy\": \"Supplier agreements and contracts include clauses addressing information security requirements, risk assessments, and compliance obligations.\",\n    \"Reference\": \"Vendor risk assessment - Jumpcloud [Internal].docx.pdf - Section 4.0 Compliance with regulatory requirements and Section 5.0 Security posture.\",\n    \"Evidence Reference\": \"(Evidence controls are applied\\\\A.5.22\\\\Vendor risk assesment - Jumpcloud [Internal].docx.pdf)\",\n    \"Implemented Evidence\": \"Vendor risk assessment includes review of GDPR compliance documentation, ISO27001 and SOC2 certifications, and security posture including MFA and vulnerability assessments, indicating information security clauses are considered in agreements.\",\n    \"Evidence Recommendation\": \"Provide actual supplier agreements or contract excerpts showing security clauses.\",\n    \"Gaps Identified\": \"No direct contract documents included.\",\n    \"Recommended Action\": \"Submit supplier agreements with explicit information security clauses.\"\n  },\n  {\n    \"Clause\": \"4\",\n    \"Section\": \"A.5 (Organisational Controls)\",\n    \"Control Id\": \"A.5.21\",\n    \"Control Title\": \"Managing information security in the ICT supply chain\",\n    \"Compliance\": \"✅\",\n    \"Policy\": \"ICT supply chain risks are managed by verifying credentials of external service providers, maintaining a key supplier list, and ensuring compliance with security policies.\",\n    \"Reference\": \"Vendor risk assessment - Jumpcloud [Internal].docx.pdf - Assessment performed by IT management; evaluation based on documentation and experience with platform.\",\n    \"Evidence Reference\": \"(Evidence controls are applied\\\\A.5.22\\\\Vendor risk assesment - Jumpcloud [Internal].docx.pdf)\",\n    \"Implemented Evidence\": \"Vendor risk assessment conducted by Head of IT Operations and Group System Administrator; assessment includes evaluation of vendor security certifications and compliance, indicating credential verification and supply chain risk management.\",\n    \"Evidence Recommendation\": \"Provide documented supplier lists and credential verification records.\",\n    \"Gaps Identified\": \"No explicit key supplier list or credential verification records included.\",\n    \"Recommended Action\": \"Submit supplier lists and evidence of credential verification.\"\n  },\n  {\n    \"Clause\": \"8\",\n    \"Section\": \"A.5 (Organisational Controls)\",\n    \"Control Id\": \"A.5.22\",\n    \"Control Title\": \"Monitoring, review and change management of supplier services\",\n    \"Compliance\": \"✅\",\n    \"Policy\": \"Contracts are managed by responsible persons who perform periodic reviews of supplier performance including SLA metrics and compliance.\",\n    \"Reference\": \"Vendor risk assessment - Jumpcloud [Internal].docx.pdf - Sections 1.0 SLA metrics, 3.0 Communication and collaboration, and 6.0 Summary & actions.\",\n    \"Evidence Reference\": \"(Evidence controls are applied\\\\A.5.22\\\\Vendor risk assesment - Jumpcloud [Internal].docx.pdf)\",\n    \"Implemented Evidence\": \"Vendor risk assessment includes SLA metrics such as system uptime, response time, escalation procedures, and overall satisfaction; communication and collaboration are reviewed; no issues reported; assessment dated and signed by IT management.\",\n    \"Evidence Recommendation\": \"Include documented periodic review reports and change management records.\",\n    \"Gaps Identified\": \"No explicit change management records or periodic review schedules included.\",\n    \"Recommended Action\": \"Submit documented supplier performance reviews and change management evidence.\"\n  },\n  {\n    \"Clause\": \"8\",\n    \"Section\": \"A.5 (Organisational Controls)\",\n    \"Control Id\": \"A.5.23\",\n    \"Control Title\": \"Information security for use of cloud services\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Use of cloud services is controlled and approved by IT management; access is restricted and aligned with access control policies.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide documented cloud service usage policies and approval records.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding cloud service controls.\",\n    \"Recommended Action\": \"Submit cloud service policies and evidence of access control enforcement.\"\n  },\n  {\n    \"Clause\": \"8\",\n    \"Section\": \"A.5 (Organisational Controls)\",\n    \"Control Id\": \"A.5.24\",\n    \"Control Title\": \"Information security incident management planning and preparation\",\n    \"Compliance\": \"✅\",\n    \"Policy\": \"Incident management procedures are established, including detection, reporting, analysis, and response preparation.\",\n    \"Reference\": \"CAPA-form [Confidential] - possible confidential sales data leaked during offboarding of employee.docx.pdf - Pages 1-2: Incident investigation, corrective and preventive actions, policy update.\",\n    \"Evidence Reference\": \"(Evidence controls are applied\\\\A.5.25\\\\#18- CAPA-form [Confidential] - possible confidential sales data leaked during offboarding of employee .docx.pdf)\",\n    \"Implemented Evidence\": \"Incident involving data leakage was investigated with forensic evidence collection; corrective actions included legal measures, staff awareness reinforcement, and policy updates to clarify personal device use.\",\n    \"Evidence Recommendation\": \"Include formal incident management procedures and training records.\",\n    \"Gaps Identified\": \"No full incident management procedure document included.\",\n    \"Recommended Action\": \"Submit documented incident management plans and evidence of staff training.\"\n  },\n  {\n    \"Clause\": \"8,10\",\n    \"Section\": \"A.5 (Organisational Controls)\",\n    \"Control Id\": \"A.5.25\",\n    \"Control Title\": \"Assessment and decision on information security events\",\n    \"Compliance\": \"✅\",\n    \"Policy\": \"Procedures exist for assessing security events and deciding if they qualify as incidents, with defined roles for decision making.\",\n    \"Reference\": \"CAPA-form [Confidential] - possible confidential sales data leaked during offboarding of employee.docx.pdf - Pages 1-2: Incident assessment and decision to file lawsuit and corrective actions.\",\n    \"Evidence Reference\": \"(Evidence controls are applied\\\\A.5.25\\\\#18- CAPA-form [Confidential] - possible confidential sales data leaked during offboarding of employee .docx.pdf)\",\n    \"Implemented Evidence\": \"Operational Director initiated investigation and decision-making on incident severity; corrective actions and legal steps taken based on assessment.\",\n    \"Evidence Recommendation\": \"Provide documented procedures defining roles and decision criteria for event assessment.\",\n    \"Gaps Identified\": \"No formal documented procedures included.\",\n    \"Recommended Action\": \"Submit documented assessment and decision-making procedures.\"\n  },\n  {\n    \"Clause\": \"8,10\",\n    \"Section\": \"A.5 (Organisational Controls)\",\n    \"Control Id\": \"A.5.26\",\n    \"Control Title\": \"Response to information security incidents\",\n    \"Compliance\": \"✅\",\n    \"Policy\": \"Incident response plans are documented and include roles, communication, and recovery actions.\",\n    \"Reference\": \"CAPA-form [Confidential] - possible confidential sales data leaked during offboarding of employee.docx.pdf - Pages 1-2: Incident response including forensic investigation, legal action, communication, and policy update.\",\n    \"Evidence Reference\": \"(Evidence controls are applied\\\\A.5.25\\\\#18- CAPA-form [Confidential] - possible confidential sales data leaked during offboarding of employee .docx.pdf)\",\n    \"Implemented Evidence\": \"Incident response included evidence gathering, legal proceedings, communication with involved parties, and policy updates to prevent recurrence.\",\n    \"Evidence Recommendation\": \"Include formal incident response plan documents and communication logs.\",\n    \"Gaps Identified\": \"No full incident response plan document included.\",\n    \"Recommended Action\": \"Submit documented incident response plans and evidence of communication.\"\n  },\n  {\n    \"Clause\": \"8,10\",\n    \"Section\": \"A.5 (Organisational Controls)\",\n    \"Control Id\": \"A.5.27\",\n    \"Control Title\": \"Learning from information security incidents\",\n    \"Compliance\": \"✅\",\n    \"Policy\": \"Incident analysis and corrective actions are documented and reviewed by management committees to improve controls.\",\n    \"Reference\": \"CAPA-form [Confidential] - possible confidential sales data leaked during offboarding of employee.docx.pdf - Pages 1-2: Root cause analysis, corrective and preventive actions, policy update, and staff awareness measures.\",\n    \"Evidence Reference\": \"(Evidence controls are applied\\\\A.5.25\\\\#18- CAPA-form [Confidential] - possible confidential sales data leaked during offboarding of employee .docx.pdf)\",\n    \"Implemented Evidence\": \"Root cause analysis identified labour conflict; corrective actions included forensic investigation and legal action; preventive actions included staff awareness and policy updates.\",\n    \"Evidence Recommendation\": \"Provide minutes of management reviews or committee meetings discussing incident learnings.\",\n    \"Gaps Identified\": \"No evidence of formal management review meetings included.\",\n    \"Recommended Action\": \"Submit documented management reviews and corrective action tracking.\"\n  },\n  {\n    \"Clause\": \"10\",\n    \"Section\": \"A.5 (Organisational Controls)\",\n    \"Control Id\": \"A.5.28\",\n    \"Control Title\": \"Collection of evidence\",\n    \"Compliance\": \"✅\",\n    \"Policy\": \"Evidence collection during incident analysis is documented and maintained in issue tracking tools to support investigation and reporting.\",\n    \"Reference\": \"CAPA-form [Confidential] - possible confidential sales data leaked during offboarding of employee.docx.pdf - Pages 1-2: Forensic evidence gathered on business laptop and Google account; evidence filed with Operational Director.\",\n    \"Evidence Reference\": \"(Evidence controls are applied\\\\A.5.25\\\\#18- CAPA-form [Confidential] - possible confidential sales data leaked during offboarding of employee .docx.pdf)\",\n    \"Implemented Evidence\": \"Forensic evidence collected and securely filed; evidence used to support investigation and legal action.\",\n    \"Evidence Recommendation\": \"Include evidence handling procedures and chain of custody documentation.\",\n    \"Gaps Identified\": \"No formal evidence handling procedures included.\",\n    \"Recommended Action\": \"Submit documented evidence collection and handling procedures.\"\n  },\n  {\n    \"Clause\": \"\",\n    \"Section\": \"A.5 (Organisational Controls)\",\n    \"Control Id\": \"A.5.29\",\n    \"Control Title\": \"Information security during disruption\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Business Continuity Plan defines procedures to manage information security during disruptive incidents, including recovery priorities and communication.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide Business Continuity Plan or disruption management procedures.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding information security during disruption.\",\n    \"Recommended Action\": \"Submit Business Continuity Plan or equivalent documentation.\"\n  },\n  {\n    \"Clause\": \"\",\n    \"Section\": \"A.5 (Organisational Controls)\",\n    \"Control Id\": \"A.5.30\",\n    \"Control Title\": \"ICT readiness for business continuity\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"ICT resources and recovery plans are defined with responsible persons and recovery time objectives to ensure readiness.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide ICT recovery plans and resource listings.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding ICT readiness.\",\n    \"Recommended Action\": \"Submit ICT recovery and readiness documentation.\"\n  },\n  {\n    \"Clause\": \"4\",\n    \"Section\": \"A.5 (Organisational Controls)\",\n    \"Control Id\": \"A.5.31\",\n    \"Control Title\": \"Identification of legal, statutory, regulatory and contractual requirements\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Legal, regulatory, contractual requirements are identified and maintained in reference documents and compliance processes.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide compliance registers or legal requirement documentation.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding identification of legal and regulatory requirements.\",\n    \"Recommended Action\": \"Submit compliance documentation.\"\n  },\n  {\n    \"Clause\": \"6\",\n    \"Section\": \"A.5 (Organisational Controls)\",\n    \"Control Id\": \"A.5.32\",\n    \"Control Title\": \"Intellectual property rights\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Procedures ensure compliance with intellectual property rights including copyright and licensing.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide documented procedures on intellectual property rights management.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding intellectual property rights.\",\n    \"Recommended Action\": \"Submit intellectual property management documentation.\"\n  },\n  {\n    \"Clause\": \"6\",\n    \"Section\": \"A.5 (Organisational Controls)\",\n    \"Control Id\": \"A.5.33\",\n    \"Control Title\": \"Protection of records\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Records and information disposal are securely managed with shredding and overwriting procedures.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide records management and disposal procedures.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding protection of records.\",\n    \"Recommended Action\": \"Submit records protection and disposal documentation.\"\n  },\n  {\n    \"Clause\": \"4\",\n    \"Section\": \"A.5 (Organisational Controls)\",\n    \"Control Id\": \"A.5.34\",\n    \"Control Title\": \"Privacy and protection of PII\",\n    \"Compliance\": \"✅\",\n    \"Policy\": \"Privacy and protection of personally identifiable information are ensured in compliance with GDPR and relevant legislation.\",\n    \"Reference\": \"Vendor risk assessment - Jumpcloud [Internal].docx.pdf - Section 4.0 Compliance with regulatory requirements including GDPR compliance documentation.\",\n    \"Evidence Reference\": \"(Evidence controls are applied\\\\A.5.22\\\\Vendor risk assesment - Jumpcloud [Internal].docx.pdf)\",\n    \"Implemented Evidence\": \"Vendor provides documented GDPR compliance and incident reporting mechanisms; staff undergo security awareness training; no compliance incidents reported.\",\n    \"Evidence Recommendation\": \"Include internal privacy policies and data protection impact assessments.\",\n    \"Gaps Identified\": \"No internal privacy policy or DPIA evidence included.\",\n    \"Recommended Action\": \"Submit internal privacy and data protection documentation.\"\n  },\n  {\n    \"Clause\": \"5,9\",\n    \"Section\": \"A.5 (Organisational Controls)\",\n    \"Control Id\": \"A.5.35\",\n    \"Control Title\": \"Independent review of information security\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Annual internal and external ISO 27001 audits and reviews by ISSC and ISWG are conducted to ensure compliance.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide audit reports or review meeting minutes.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding independent reviews.\",\n    \"Recommended Action\": \"Submit audit and review documentation.\"\n  },\n  {\n    \"Clause\": \"5,9,10\",\n    \"Section\": \"A.5 (Organisational Controls)\",\n    \"Control Id\": \"A.5.36\",\n    \"Control Title\": \"Compliance with policies and standards for information security\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Compliance is enforced through policies, disciplinary processes, audits, and management reviews.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide evidence of compliance enforcement such as disciplinary records or audit findings.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding compliance enforcement.\",\n    \"Recommended Action\": \"Submit compliance enforcement documentation.\"\n  },\n  {\n    \"Clause\": \"\",\n    \"Section\": \"A.5 (Organisational Controls)\",\n    \"Control Id\": \"A.5.37\",\n    \"Control Title\": \"Documented operating procedures\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Operating procedures are documented and maintained for key processes including incident management, change management, and backup.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide documented operating procedures for key processes.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding documented operating procedures.\",\n    \"Recommended Action\": \"Submit documented procedures.\"\n  },\n  {\n    \"Clause\": \"7\",\n    \"Section\": \"A.6 (People Controls)\",\n    \"Control Id\": \"A.6.1\",\n    \"Control Title\": \"Screening\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Background verification and competence checks are performed on candidates in accordance with laws and business needs.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide screening procedures or records.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding screening.\",\n    \"Recommended Action\": \"Submit screening documentation.\"\n  },\n  {\n    \"Clause\": \"7\",\n    \"Section\": \"A.6 (People Controls)\",\n    \"Control Id\": \"A.6.2\",\n    \"Control Title\": \"Terms and conditions of employment\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Information Security Policy includes screening, background checks, and termination procedures; Business Continuity Plan mentions HR responsibilities for site access and transportation.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Develop and document formal terms and conditions of employment that explicitly include information security responsibilities and obligations.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding terms and conditions of employment.\",\n    \"Recommended Action\": \"Submit employment contract templates or clauses covering security obligations.\"\n  },\n  {\n    \"Clause\": \"7\",\n    \"Section\": \"A.6 (People Controls)\",\n    \"Control Id\": \"A.6.3\",\n    \"Control Title\": \"Information security awareness, education and training\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"All employees and contractors must receive appropriate awareness, education, and training on organizational policies and procedures related to their job function.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide training records or awareness program documentation.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding awareness and training.\",\n    \"Recommended Action\": \"Submit training schedules and attendance records.\"\n  },\n  {\n    \"Clause\": \"7\",\n    \"Section\": \"A.6 (People Controls)\",\n    \"Control Id\": \"A.6.4\",\n    \"Control Title\": \"Disciplinary process\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Failure to comply with the Information Security Policy or related rules may result in disciplinary action including termination of employment.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide disciplinary process documentation and records of enforcement.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding disciplinary processes.\",\n    \"Recommended Action\": \"Submit disciplinary policy and enforcement evidence.\"\n  },\n  {\n    \"Clause\": \"7\",\n    \"Section\": \"A.6 (People Controls)\",\n    \"Control Id\": \"A.6.5\",\n    \"Control Title\": \"Responsibilities after termination or change of employment\",\n    \"Compliance\": \"✅\",\n    \"Policy\": \"Access to information systems and physical access must be removed on termination day; company belongings must be returned; documented termination and role change processes are in place.\",\n    \"Reference\": \"CAPA-form [Confidential] - possible confidential sales data leaked during offboarding of employee.docx.pdf - Pages 1-2: Incident involving data leakage during employee offboarding and corrective actions including access removal and asset return.\",\n    \"Evidence Reference\": \"(Evidence controls are applied\\\\A.5.25\\\\#18- CAPA-form [Confidential] - possible confidential sales data leaked during offboarding of employee .docx.pdf)\",\n    \"Implemented Evidence\": \"Investigation and corrective actions included removal of access on termination day, return of company assets, and legal agreements ensuring no retention of company information.\",\n    \"Evidence Recommendation\": \"Include formal termination procedures and access removal checklists.\",\n    \"Gaps Identified\": \"No formal termination procedure document included.\",\n    \"Recommended Action\": \"Submit documented termination and access removal procedures.\"\n  },\n  {\n    \"Clause\": \"\",\n    \"Section\": \"A.6 (People Controls)\",\n    \"Control Id\": \"A.6.6\",\n    \"Control Title\": \"Confidentiality or non-disclosure agreements\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"All external service providers must sign NDAs or have equivalent confidentiality clauses; internal employees are bound by confidentiality clauses in contracts.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide NDA templates or signed agreements.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding NDAs.\",\n    \"Recommended Action\": \"Submit confidentiality agreement documentation.\"\n  },\n  {\n    \"Clause\": \"\",\n    \"Section\": \"A.6 (People Controls)\",\n    \"Control Id\": \"A.6.7\",\n    \"Control Title\": \"Remote working\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Business Continuity Plan allows most employees to work from home/cloud; mobile device policy and remote access controls exist but no detailed remote working security policy found.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Develop and document a comprehensive remote working security policy addressing access controls, device security, and user responsibilities.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding remote working policies.\",\n    \"Recommended Action\": \"Submit remote working security policy.\"\n  },\n  {\n    \"Clause\": \"\",\n    \"Section\": \"A.6 (People Controls)\",\n    \"Control Id\": \"A.6.8\",\n    \"Control Title\": \"Information security event reporting\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Procedures for reporting security incidents are established; users must report security violations immediately; incident management processes are defined.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide incident reporting procedures and evidence of communication to users.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding event reporting.\",\n    \"Recommended Action\": \"Submit incident reporting procedures and awareness materials.\"\n  },\n  {\n    \"Clause\": \"8\",\n    \"Section\": \"A.7 (Physical Controls)\",\n    \"Control Id\": \"A.7.1\",\n    \"Control Title\": \"Physical security perimeter\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Physical access is controlled via card swipe systems and personal keys; central alarm systems per floor; secured server racks; visitor escort policies.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide physical security access control records or system descriptions.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding physical security perimeter.\",\n    \"Recommended Action\": \"Submit physical access control documentation.\"\n  },\n  {\n    \"Clause\": \"\",\n    \"Section\": \"A.7 (Physical Controls)\",\n    \"Control Id\": \"A.7.2\",\n    \"Control Title\": \"Physical entry controls\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Access to buildings and rooms controlled by card swipe, keys; keys signed out and returned; visitors escorted; emergency access procedures exist.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide visitor logs, key management records, or emergency access procedures.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding physical entry controls.\",\n    \"Recommended Action\": \"Submit physical entry control documentation.\"\n  },\n  {\n    \"Clause\": \"\",\n    \"Section\": \"A.7 (Physical Controls)\",\n    \"Control Id\": \"A.7.3\",\n    \"Control Title\": \"Securing offices, rooms and facilities\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Server racks locked; doors locked by default; access restricted to authorized personnel; physical security monitored.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide physical security monitoring records or access logs.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding securing offices and facilities.\",\n    \"Recommended Action\": \"Submit physical security documentation.\"\n  },\n  {\n    \"Clause\": \"8\",\n    \"Section\": \"A.7 (Physical Controls)\",\n    \"Control Id\": \"A.7.4\",\n    \"Control Title\": \"Physical security monitoring\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Alarm systems per floor exist; no explicit mention of CCTV or continuous monitoring.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Implement and document physical security monitoring measures including CCTV and intrusion detection where applicable.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding physical security monitoring.\",\n    \"Recommended Action\": \"Submit physical security monitoring procedures and system descriptions.\"\n  },\n  {\n    \"Clause\": \"\",\n    \"Section\": \"A.7 (Physical Controls)\",\n    \"Control Id\": \"A.7.5\",\n    \"Control Title\": \"Protecting against physical and environmental threats\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Business Continuity Plan addresses facility disasters and contacts local authorities; no detailed environmental controls described.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Develop and document physical and environmental protection controls to mitigate threats like fire, flood, and other hazards.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding physical/environmental protection.\",\n    \"Recommended Action\": \"Submit environmental protection controls documentation.\"\n  },\n  {\n    \"Clause\": \"\",\n    \"Section\": \"A.7 (Physical Controls)\",\n    \"Control Id\": \"A.7.6\",\n    \"Control Title\": \"Working in secure areas\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Access to secure areas restricted to authorized personnel; visitors escorted; no detailed procedures for working in secure areas.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Establish and document procedures for working securely in secure areas including access, supervision, and monitoring.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding working in secure areas.\",\n    \"Recommended Action\": \"Submit procedures for secure area working.\"\n  },\n  {\n    \"Clause\": \"\",\n    \"Section\": \"A.7 (Physical Controls)\",\n    \"Control Id\": \"A.7.7\",\n    \"Control Title\": \"Clear desk and clear screen\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Clear desk recommended; personal information and critical information must not be left unattended; regular internal audits performed.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide audit reports or awareness materials on clear desk and screen policies.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding clear desk and screen.\",\n    \"Recommended Action\": \"Submit clear desk/screen policy evidence.\"\n  },\n  {\n    \"Clause\": \"\",\n    \"Section\": \"A.7 (Physical Controls)\",\n    \"Control Id\": \"A.7.8\",\n    \"Control Title\": \"Equipment siting and protection\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Equipment inventory and asset management described; no explicit controls on equipment siting or protection from environmental or unauthorized access.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Define and document equipment siting and protection controls to prevent damage or unauthorized access.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding equipment siting and protection.\",\n    \"Recommended Action\": \"Submit equipment siting and protection documentation.\"\n  },\n  {\n    \"Clause\": \"\",\n    \"Section\": \"A.7 (Physical Controls)\",\n    \"Control Id\": \"A.7.9\",\n    \"Control Title\": \"Security of assets off-premises\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Mobile device policy includes protection of devices off-premises; equipment must be returned on termination; use of encryption on laptops.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide mobile device policy and evidence of enforcement.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding off-premises asset security.\",\n    \"Recommended Action\": \"Submit mobile device security documentation.\"\n  },\n  {\n    \"Clause\": \"\",\n    \"Section\": \"A.7 (Physical Controls)\",\n    \"Control Id\": \"A.7.10\",\n    \"Control Title\": \"Storage media\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Storage media disposal and handling policies defined; media destruction procedures in place; backups stored securely off-site.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide media handling and disposal procedures.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding storage media controls.\",\n    \"Recommended Action\": \"Submit storage media management documentation.\"\n  },\n  {\n    \"Clause\": \"\",\n    \"Section\": \"A.7 (Physical Controls)\",\n    \"Control Id\": \"A.7.11\",\n    \"Control Title\": \"Supporting utilities\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Business Continuity Plan lists electricity and facilities contacts; no detailed controls for utilities protection or redundancy.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Develop and document controls for supporting utilities including redundancy, monitoring, and maintenance.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding supporting utilities.\",\n    \"Recommended Action\": \"Submit supporting utilities control documentation.\"\n  },\n  {\n    \"Clause\": \"\",\n    \"Section\": \"A.7 (Physical Controls)\",\n    \"Control Id\": \"A.7.12\",\n    \"Control Title\": \"Cabling security\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Cabling must be installed and secured according to local or European regulations.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide cabling installation and security procedures.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding cabling security.\",\n    \"Recommended Action\": \"Submit cabling security documentation.\"\n  },\n  {\n    \"Clause\": \"\",\n    \"Section\": \"A.7 (Physical Controls)\",\n    \"Control Id\": \"A.7.13\",\n    \"Control Title\": \"Equipment maintenance\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"The Business Continuity Plan and Information Security Policy mention equipment repair and replacement decisions during disruptive incidents and responsibility assignments for equipment repair and purchasing.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Develop and document formal equipment maintenance procedures and schedules to ensure ongoing maintenance and reduce risk of failure.\",\n    \"Gaps Identified\": \"No detailed documented procedures or schedules for regular equipment maintenance found in the text.\",\n    \"Recommended Action\": \"Submit equipment maintenance procedures and schedules.\"\n  },\n  {\n    \"Clause\": \"\",\n    \"Section\": \"A.7 (Physical Controls)\",\n    \"Control Id\": \"A.7.14\",\n    \"Control Title\": \"Secure disposal or re‑use of equipment\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Information disposal and media disposal policies are documented, including secure destruction of media and return of company equipment upon termination.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide documented procedures for secure disposal or reuse of equipment.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding secure disposal or reuse of equipment.\",\n    \"Recommended Action\": \"Submit disposal and reuse procedures.\"\n  },\n  {\n    \"Clause\": \"8\",\n    \"Section\": \"A.8 (Technological Controls)\",\n    \"Control Id\": \"A.8.1\",\n    \"Control Title\": \"User endpoint devices\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Policies cover management, protection, and secure use of user endpoint devices including laptops, mobile devices, and workstations.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide endpoint device management policies and usage guidelines.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding user endpoint device management.\",\n    \"Recommended Action\": \"Submit endpoint device policies.\"\n  },\n  {\n    \"Clause\": \"\",\n    \"Section\": \"A.8 (Technological Controls)\",\n    \"Control Id\": \"A.8.2\",\n    \"Control Title\": \"Privileged access rights\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Privileged access rights are controlled by formal authorization, minimum necessary assignment, and segregation from regular user IDs.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide privileged access management procedures and authorization records.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding privileged access rights.\",\n    \"Recommended Action\": \"Submit privileged access management documentation.\"\n  },\n  {\n    \"Clause\": \"8\",\n    \"Section\": \"A.8 (Technological Controls)\",\n    \"Control Id\": \"A.8.3\",\n    \"Control Title\": \"Information access restriction\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Access to information and systems is controlled on a need-to-know basis with formal access control policies and user access management.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide access restriction policies and user access review records.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding information access restriction.\",\n    \"Recommended Action\": \"Submit access control policies and review evidence.\"\n  },\n  {\n    \"Clause\": \"\",\n    \"Section\": \"A.8 (Technological Controls)\",\n    \"Control Id\": \"A.8.4\",\n    \"Control Title\": \"Access to source code\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Access to source code is restricted and controlled with secure repositories and access control.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide source code access control policies and repository access logs.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding source code access control.\",\n    \"Recommended Action\": \"Submit source code access control documentation.\"\n  },\n  {\n    \"Clause\": \"\",\n    \"Section\": \"A.8 (Technological Controls)\",\n    \"Control Id\": \"A.8.5\",\n    \"Control Title\": \"Secure authentication\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Strong authentication policies including password complexity, management, and two-factor authentication are implemented.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide authentication policy documents and system configuration evidence.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding secure authentication.\",\n    \"Recommended Action\": \"Submit authentication policies and enforcement evidence.\"\n  },\n  {\n    \"Clause\": \"8\",\n    \"Section\": \"A.8 (Technological Controls)\",\n    \"Control Id\": \"A.8.6\",\n    \"Control Title\": \"Capacity management\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Capacity management is addressed through monitoring and planning of IT infrastructure and resources.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide capacity management plans and monitoring reports.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding capacity management.\",\n    \"Recommended Action\": \"Submit capacity management documentation.\"\n  },\n  {\n    \"Clause\": \"8\",\n    \"Section\": \"A.8 (Technological Controls)\",\n    \"Control Id\": \"A.8.7\",\n    \"Control Title\": \"Protection against malware\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Comprehensive malware protection including prevention, detection, and recovery is implemented.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide malware protection policies and incident reports.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding malware protection.\",\n    \"Recommended Action\": \"Submit malware protection documentation.\"\n  },\n  {\n    \"Clause\": \"8\",\n    \"Section\": \"A.8 (Technological Controls)\",\n    \"Control Id\": \"A.8.8\",\n    \"Control Title\": \"Management of technical vulnerabilities\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Vulnerability management process including acquisition of vulnerability info, assessment, testing, and patch deployment is established.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide vulnerability management procedures and patching records.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding vulnerability management.\",\n    \"Recommended Action\": \"Submit vulnerability management documentation.\"\n  },\n  {\n    \"Clause\": \"8\",\n    \"Section\": \"A.8 (Technological Controls)\",\n    \"Control Id\": \"A.8.9\",\n    \"Control Title\": \"Configuration management\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Configuration management is documented, reviewed, and controlled with change management processes.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide configuration management policies and change logs.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding configuration management.\",\n    \"Recommended Action\": \"Submit configuration management documentation.\"\n  },\n  {\n    \"Clause\": \"7\",\n    \"Section\": \"A.8 (Technological Controls)\",\n    \"Control Id\": \"A.8.10\",\n    \"Control Title\": \"Information deletion\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Information and media disposal policies ensure secure deletion and destruction of data and media.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide information deletion policies and evidence of secure disposal.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding information deletion.\",\n    \"Recommended Action\": \"Submit information deletion documentation.\"\n  },\n  {\n    \"Clause\": \"\",\n    \"Section\": \"A.8 (Technological Controls)\",\n    \"Control Id\": \"A.8.11\",\n    \"Control Title\": \"Data masking\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"No explicit mention or policy on data masking or anonymization techniques in the documents.\",\n    \"Reference\": \"No references found in Business Continuity Plan or Information Security Policy regarding data masking.\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Develop and implement data masking policies and procedures, especially for use in testing and development environments.\",\n    \"Gaps Identified\": \"No evidence found in the text regarding data masking.\",\n    \"Recommended Action\": \"Create and document data masking controls.\"\n  },\n  {\n    \"Clause\": \"\",\n    \"Section\": \"A.8 (Technological Controls)\",\n    \"Control Id\": \"A.8.12\",\n    \"Control Title\": \"Data leakage prevention\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Data leakage incidents are addressed in incident response plans; some controls on information sharing and access exist.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Implement and document technical data leakage prevention controls and monitoring.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding technical data leakage prevention.\",\n    \"Recommended Action\": \"Submit data leakage prevention controls and monitoring evidence.\"\n  },\n  {\n    \"Clause\": \"8\",\n    \"Section\": \"A.8 (Technological Controls)\",\n    \"Control Id\": \"A.8.13\",\n    \"Control Title\": \"Information backup\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Comprehensive backup policies and procedures are documented, including frequency, retention, storage, testing, and restoration.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide backup policy documents and test reports.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding backup.\",\n    \"Recommended Action\": \"Submit backup policies and testing evidence.\"\n  },\n  {\n    \"Clause\": \"8\",\n    \"Section\": \"A.8 (Technological Controls)\",\n    \"Control Id\": \"A.8.14\",\n    \"Control Title\": \"Redundancy of information processing facilities\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Business Continuity Plan addresses alternative sites and recovery time objectives; some redundancy implied but not detailed.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Document and implement detailed redundancy controls and infrastructure.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding redundancy controls.\",\n    \"Recommended Action\": \"Submit redundancy architecture and controls documentation.\"\n  },\n  {\n    \"Clause\": \"9\",\n    \"Section\": \"A.8 (Technological Controls)\",\n    \"Control Id\": \"A.8.15\",\n    \"Control Title\": \"Logging\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Logging policies and procedures are established including log management, retention, and monitoring.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide logging policy documents and log review reports.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding logging.\",\n    \"Recommended Action\": \"Submit logging policies and monitoring evidence.\"\n  },\n  {\n    \"Clause\": \"9\",\n    \"Section\": \"A.8 (Technological Controls)\",\n    \"Control Id\": \"A.8.16\",\n    \"Control Title\": \"Monitoring activities\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Procedures for monitoring, detecting, analyzing, and reporting information security events are established.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide monitoring procedures and incident reports.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding monitoring activities.\",\n    \"Recommended Action\": \"Submit monitoring procedures and evidence.\"\n  },\n  {\n    \"Clause\": \"9\",\n    \"Section\": \"A.8 (Technological Controls)\",\n    \"Control Id\": \"A.8.17\",\n    \"Control Title\": \"Clock synchronisation\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"All computing systems managed must synchronise time with a central time server to ensure accuracy of audit logs.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide clock synchronization policies and system configuration evidence.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding clock synchronization.\",\n    \"Recommended Action\": \"Submit clock synchronization documentation.\"\n  },\n  {\n    \"Clause\": \"\",\n    \"Section\": \"A.8 (Technological Controls)\",\n    \"Control Id\": \"A.8.18\",\n    \"Control Title\": \"Use of privileged utility programs\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Privileged utility programs or software should be approved by the IT department or system administrator; laptops/desktops have no administrator privileges enabled.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide approval procedures and system configuration evidence.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding privileged utility programs.\",\n    \"Recommended Action\": \"Submit privileged utility program controls.\"\n  },\n  {\n    \"Clause\": \"\",\n    \"Section\": \"A.8 (Technological Controls)\",\n    \"Control Id\": \"A.8.19\",\n    \"Control Title\": \"Installation of software on operational systems\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Users are prohibited from installing unauthorized software; only licensed software owned by the company is allowed; anti-virus and patch management policies are enforced.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide software installation policies and enforcement evidence.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding software installation controls.\",\n    \"Recommended Action\": \"Submit software installation policies.\"\n  },\n  {\n    \"Clause\": \"9\",\n    \"Section\": \"A.8 (Technological Controls)\",\n    \"Control Id\": \"A.8.20\",\n    \"Control Title\": \"Network security\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Network security is maintained by firewalls, access controls, logging, encryption for data over public networks, and regular patching of network devices.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide network security policies and monitoring reports.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding network security.\",\n    \"Recommended Action\": \"Submit network security documentation.\"\n  },\n  {\n    \"Clause\": \"\",\n    \"Section\": \"A.8 (Technological Controls)\",\n    \"Control Id\": \"A.8.21\",\n    \"Control Title\": \"Security of network services\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Network services are controlled via firewalls and access restrictions; however, explicit documented procedures for management of network services are not detailed.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Develop and document formal procedures for management and security of network services.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding network service management.\",\n    \"Recommended Action\": \"Submit network service management procedures.\"\n  },\n  {\n    \"Clause\": \"\",\n    \"Section\": \"A.8 (Technological Controls)\",\n    \"Control Id\": \"A.8.22\",\n    \"Control Title\": \"Segregation of networks\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Logical separation of networks is enforced using firewalls to prevent unauthorized access from public or wireless networks.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide network segregation policies and firewall configuration evidence.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding network segregation.\",\n    \"Recommended Action\": \"Submit network segregation documentation.\"\n  },\n  {\n    \"Clause\": \"9\",\n    \"Section\": \"A.8 (Technological Controls)\",\n    \"Control Id\": \"A.8.23\",\n    \"Control Title\": \"Web filtering\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Web filtering or URL filtering is implemented on firewalls, routers, or switches to block web traffic and protect against threats.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide web filtering policies and configuration evidence.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding web filtering.\",\n    \"Recommended Action\": \"Submit web filtering documentation.\"\n  },\n  {\n    \"Clause\": \"\",\n    \"Section\": \"A.8 (Technological Controls)\",\n    \"Control Id\": \"A.8.24\",\n    \"Control Title\": \"Use of cryptography\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Encryption is used for HDDs, VPN connections, wireless networks, cloud applications (TLS 1.2+), and wireless access with WPA/WPA2; regular testing of TLS security is performed.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide cryptography policies and evidence of encryption implementation.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding cryptography.\",\n    \"Recommended Action\": \"Submit cryptography documentation.\"\n  },\n  {\n    \"Clause\": \"\",\n    \"Section\": \"A.8 (Technological Controls)\",\n    \"Control Id\": \"A.8.25\",\n    \"Control Title\": \"Secure development life cycle\",\n    \"Compliance\": \"✅\",\n    \"Policy\": \"Documented SDLC policies and procedures exist; external providers’ SDLC reviewed; quality checks and periodic reviews are performed.\",\n    \"Reference\": \"System development life cycle [Confidential].pptx.pdf - Pages 3-5: Detailed SDLC including testing stages, branch protection, pull-request strategy, and code review.\",\n    \"Evidence Reference\": \"(Evidence controls are applied\\\\A.5.8\\\\4.4.1.6.1 System development life cycle [Confidential].pptx.pdf)\",\n    \"Implemented Evidence\": \"SDLC includes unit, integration, performance, vulnerability, and acceptance testing; branch protection rules require approvals; code reviews performed; external provider SDLC under review.\",\n    \"Evidence Recommendation\": \"Include formal SDLC policy documents and evidence of external provider SDLC reviews.\",\n    \"Gaps Identified\": \"GitHub security policies under investigation; no formal external provider SDLC review evidence.\",\n    \"Recommended Action\": \"Finalize and document SDLC policies and external provider reviews.\"\n  },\n  {\n    \"Clause\": \"6\",\n    \"Section\": \"A.8 (Technological Controls)\",\n    \"Control Id\": \"A.8.26\",\n    \"Control Title\": \"Application security requirements\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Security requirements are identified and agreed prior to development; audit trails and access controls are implemented; data input validation and privacy protections are included.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide application security requirement documents and implementation evidence.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding application security requirements.\",\n    \"Recommended Action\": \"Submit application security documentation.\"\n  },\n  {\n    \"Clause\": \"\",\n    \"Section\": \"A.8 (Technological Controls)\",\n    \"Control Id\": \"A.8.27\",\n    \"Control Title\": \"Secure systems architecture and engineering principles\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"System hardening and minimal package installation are required for Unix systems; IP restrictions and removal of unnecessary services are enforced; however, no comprehensive documented architecture principles are detailed.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Develop and document comprehensive secure systems architecture and engineering principles.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding secure systems architecture.\",\n    \"Recommended Action\": \"Submit secure architecture and engineering principles documentation.\"\n  },\n  {\n    \"Clause\": \"6\",\n    \"Section\": \"A.8 (Technological Controls)\",\n    \"Control Id\": \"A.8.28\",\n    \"Control Title\": \"Secure coding\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Code is reviewed prior to release by personnel other than the author; secure coding guidelines are followed; code repositories enforce access control and versioning.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide secure coding guidelines and code review records.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding secure coding.\",\n    \"Recommended Action\": \"Submit secure coding documentation.\"\n  },\n  {\n    \"Clause\": \"8\",\n    \"Section\": \"A.8 (Technological Controls)\",\n    \"Control Id\": \"A.8.29\",\n    \"Control Title\": \"Security testing in development and acceptance\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Application security testing is performed manually and automatically; PEN-tests are conducted annually; acceptance criteria and testing procedures are documented.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide security testing procedures and PEN-test reports.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding security testing.\",\n    \"Recommended Action\": \"Submit security testing documentation.\"\n  },\n  {\n    \"Clause\": \"\",\n    \"Section\": \"A.8 (Technological Controls)\",\n    \"Control Id\": \"A.8.30\",\n    \"Control Title\": \"Outsourced development\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Outsourced development requires review of SDLC methodology; licensing, code ownership, and IP rights must be agreed in contracts; PEN-tests and ISO certifications are required for contractors.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide outsourced development contracts and SDLC review records.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding outsourced development.\",\n    \"Recommended Action\": \"Submit outsourced development documentation.\"\n  },\n  {\n    \"Clause\": \"6\",\n    \"Section\": \"A.8 (Technological Controls)\",\n    \"Control Id\": \"A.8.31\",\n    \"Control Title\": \"Separation of development, test and production environments\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Development, test, and production environments are separated; access to development and test systems is restricted; test data is anonymised or masked.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide environment separation policies and access control evidence.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding environment separation.\",\n    \"Recommended Action\": \"Submit environment separation documentation.\"\n  },\n  {\n    \"Clause\": \"8\",\n    \"Section\": \"A.8 (Technological Controls)\",\n    \"Control Id\": \"A.8.32\",\n    \"Control Title\": \"Change management\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Changes to information processing facilities and systems are controlled via documented change management processes including review, approval, testing, and communication.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide change management procedures and records.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding change management.\",\n    \"Recommended Action\": \"Submit change management documentation.\"\n  },\n  {\n    \"Clause\": \"\",\n    \"Section\": \"A.8 (Technological Controls)\",\n    \"Control Id\": \"A.8.33\",\n    \"Control Title\": \"Test information\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Test environments use limited or anonymised data; production data is not used for testing; test data is removed before promotion to production.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Provide test data management policies and evidence of data anonymization.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding test information controls.\",\n    \"Recommended Action\": \"Submit test data management documentation.\"\n  },\n  {\n    \"Clause\": \"\",\n    \"Section\": \"A.8 (Technological Controls)\",\n    \"Control Id\": \"A.8.34\",\n    \"Control Title\": \"Protection of information systems during audit testing\",\n    \"Compliance\": \"❌\",\n    \"Policy\": \"Security incident management and logging policies exist; however, explicit controls or procedures for protecting information systems during audit testing are not detailed.\",\n    \"Reference\": \"\",\n    \"Evidence Reference\": \"\",\n    \"Implemented Evidence\": \"\",\n    \"Evidence Recommendation\": \"Develop and document procedures to protect information systems during audit testing.\",\n    \"Gaps Identified\": \"No new evidence found in the text regarding protection during audit testing.\",\n    \"Recommended Action\": \"Submit audit testing protection procedures.\"\n  }\n]"