{"Clause":{"0":"4,5","1":"4,5","2":"5","3":"5,6,9,10","4":"","5":"","6":"6","7":"7","8":"","9":"6","10":"","11":"6","12":"","13":"4,8","14":"","15":"","16":"","17":"","18":"4,8","19":"8","20":"4","21":"8","22":"8","23":"8","24":"8,10","25":"8,10","26":"8,10","27":"10","28":"","29":"","30":"4","31":"6","32":"6","33":"4","34":"5,9","35":"5,9,10","36":"","37":"7","38":"7","39":"7","40":"7","41":"7","42":"","43":"","44":"","45":"8","46":"","47":"","48":"8","49":"","50":"","51":"","52":"","53":"","54":"","55":"","56":"","57":"","58":"","59":"8","60":"","61":"8","62":"","63":"","64":"8","65":"8","66":"8","67":"8","68":"7","69":"","70":"","71":"8","72":"8","73":"9","74":"9","75":"9","76":"","77":"","78":"9","79":"","80":"","81":"9","82":"","83":"","84":"6","85":"","86":"6","87":"8","88":"","89":"6","90":"8","91":"","92":""},"Section":{"0":"A.5 (Organisational Controls)","1":"A.5 (Organisational Controls)","2":"A.5 (Organisational Controls)","3":"A.5 (Organisational Controls)","4":"A.5 (Organisational Controls)","5":"A.5 (Organisational Controls)","6":"A.5 (Organisational Controls)","7":"A.5 (Organisational Controls)","8":"A.5 (Organisational Controls)","9":"A.5 (Organisational Controls)","10":"A.5 (Organisational Controls)","11":"A.5 (Organisational Controls)","12":"A.5 (Organisational Controls)","13":"A.5 (Organisational Controls)","14":"A.5 (Organisational Controls)","15":"A.5 (Organisational Controls)","16":"A.5 (Organisational Controls)","17":"A.5 (Organisational Controls)","18":"A.5 (Organisational Controls)","19":"A.5 (Organisational Controls)","20":"A.5 (Organisational Controls)","21":"A.5 (Organisational Controls)","22":"A.5 (Organisational Controls)","23":"A.5 (Organisational Controls)","24":"A.5 (Organisational Controls)","25":"A.5 (Organisational Controls)","26":"A.5 (Organisational Controls)","27":"A.5 (Organisational Controls)","28":"A.5 (Organisational Controls)","29":"A.5 (Organisational Controls)","30":"A.5 (Organisational Controls)","31":"A.5 (Organisational Controls)","32":"A.5 (Organisational Controls)","33":"A.5 (Organisational Controls)","34":"A.5 (Organisational Controls)","35":"A.5 (Organisational Controls)","36":"A.5 (Organisational Controls)","37":"A.6 (People Controls)","38":"A.6 (People Controls)","39":"A.6 (People Controls)","40":"A.6 (People Controls)","41":"A.6 (People Controls)","42":"A.6 (People Controls)","43":"A.6 (People Controls)","44":"A.6 (People Controls)","45":"A.7 (Physical Controls)","46":"A.7 (Physical Controls)","47":"A.7 (Physical Controls)","48":"A.7 (Physical Controls)","49":"A.7 (Physical Controls)","50":"A.7 (Physical Controls)","51":"A.7 (Physical Controls)","52":"A.7 (Physical Controls)","53":"A.7 (Physical Controls)","54":"A.7 (Physical Controls)","55":"A.7 (Physical Controls)","56":"A.7 (Physical Controls)","57":"A.7 (Physical Controls)","58":"A.7 (Physical Controls)","59":"A.8 (Technological Controls)","60":"A.8 (Technological Controls)","61":"A.8 (Technological Controls)","62":"A.8 (Technological Controls)","63":"A.8 (Technological Controls)","64":"A.8 (Technological Controls)","65":"A.8 (Technological Controls)","66":"A.8 (Technological Controls)","67":"A.8 (Technological Controls)","68":"A.8 (Technological Controls)","69":"A.8 (Technological Controls)","70":"A.8 (Technological Controls)","71":"A.8 (Technological Controls)","72":"A.8 (Technological Controls)","73":"A.8 (Technological Controls)","74":"A.8 (Technological Controls)","75":"A.8 (Technological Controls)","76":"A.8 (Technological Controls)","77":"A.8 (Technological Controls)","78":"A.8 (Technological Controls)","79":"A.8 (Technological Controls)","80":"A.8 (Technological Controls)","81":"A.8 (Technological Controls)","82":"A.8 (Technological Controls)","83":"A.8 (Technological Controls)","84":"A.8 (Technological Controls)","85":"A.8 (Technological Controls)","86":"A.8 (Technological Controls)","87":"A.8 (Technological Controls)","88":"A.8 (Technological Controls)","89":"A.8 (Technological Controls)","90":"A.8 (Technological Controls)","91":"A.8 (Technological Controls)","92":"A.8 (Technological Controls)"},"Control Id":{"0":"A.5.1","1":"A.5.2","2":"A.5.3","3":"A.5.4","4":"A.5.5","5":"A.5.6","6":"A.5.7","7":"A.5.8","8":"A.5.9","9":"A.5.10","10":"A.5.11","11":"A.5.12","12":"A.5.13","13":"A.5.14","14":"A.5.15","15":"A.5.16","16":"A.5.17","17":"A.5.18","18":"A.5.19","19":"A.5.20","20":"A.5.21","21":"A.5.22","22":"A.5.23","23":"A.5.24","24":"A.5.25","25":"A.5.26","26":"A.5.27","27":"A.5.28","28":"A.5.29","29":"A.5.30","30":"A.5.31","31":"A.5.32","32":"A.5.33","33":"A.5.34","34":"A.5.35","35":"A.5.36","36":"A.5.37","37":"A.6.1","38":"A.6.2","39":"A.6.3","40":"A.6.4","41":"A.6.5","42":"A.6.6","43":"A.6.7","44":"A.6.8","45":"A.7.1","46":"A.7.2","47":"A.7.3","48":"A.7.4","49":"A.7.5","50":"A.7.6","51":"A.7.7","52":"A.7.8","53":"A.7.9","54":"A.7.10","55":"A.7.11","56":"A.7.12","57":"A.7.13","58":"A.7.14","59":"A.8.1","60":"A.8.2","61":"A.8.3","62":"A.8.4","63":"A.8.5","64":"A.8.6","65":"A.8.7","66":"A.8.8","67":"A.8.9","68":"A.8.10","69":"A.8.11","70":"A.8.12","71":"A.8.13","72":"A.8.14","73":"A.8.15","74":"A.8.16","75":"A.8.17","76":"A.8.18","77":"A.8.19","78":"A.8.20","79":"A.8.21","80":"A.8.22","81":"A.8.23","82":"A.8.24","83":"A.8.25","84":"A.8.26","85":"A.8.27","86":"A.8.28","87":"A.8.29","88":"A.8.30","89":"A.8.31","90":"A.8.32","91":"A.8.33","92":"A.8.34"},"Control Title":{"0":"Policies for information security","1":"Information security roles and responsibilities","2":"Segregation of duties","3":"Management responsibilities","4":"Contact with authorities","5":"Contact with special interest groups","6":"Threat intelligence","7":"Information security in project management","8":"Inventory of information and other associated assets","9":"Acceptable use of information and other associated assets","10":"Return of assets","11":"Classification of information","12":"Labelling of information","13":"Information transfer","14":"Access control","15":"Identity management","16":"Authentication information","17":"Access rights","18":"Information security in supplier relationships","19":"Addressing information security within supplier agreements","20":"Managing information security in the ICT supply chain","21":"Monitoring, review and change management of supplier services","22":"Information security for use of cloud services","23":"Information security incident management planning and preparation","24":"Assessment and decision on information security events","25":"Response to information security incidents","26":"Learning from information security incidents","27":"Collection of evidence","28":"Information security during disruption","29":"ICT readiness for business continuity","30":"Identification of legal, statutory, regulatory and contractual requirements","31":"Intellectual property rights","32":"Protection of records","33":"Privacy and protection of PII","34":"Independent review of information security","35":"Compliance with policies and standards for information security","36":"Documented operating procedures","37":"Screening","38":"Terms and conditions of employment","39":"Information security awareness, education and training","40":"Disciplinary process","41":"Responsibilities after termination or change of employment","42":"Confidentiality or non-disclosure agreements","43":"Remote working","44":"Information security event reporting","45":"Physical security perimeter","46":"Physical entry controls","47":"Securing offices, rooms and facilities","48":"Physical security monitoring","49":"Protecting against physical and environmental threats","50":"Working in secure areas","51":"Clear desk and clear screen","52":"Equipment siting and protection","53":"Security of assets off-premises","54":"Storage media","55":"Supporting utilities","56":"Cabling security","57":"Equipment maintenance","58":"Secure disposal or re‑use of equipment","59":"User endpoint devices","60":"Privileged access rights","61":"Information access restriction","62":"Access to source code","63":"Secure authentication","64":"Capacity management","65":"Protection against malware","66":"Management of technical vulnerabilities","67":"Configuration management","68":"Information deletion","69":"Data masking","70":"Data leakage prevention","71":"Information backup","72":"Redundancy of information processing facilities","73":"Logging","74":"Monitoring activities","75":"Clock synchronisation","76":"Use of privileged utility programs","77":"Installation of software on operational systems","78":"Network security","79":"Security of network services","80":"Segregation of networks","81":"Web filtering","82":"Use of cryptography","83":"Secure development life cycle","84":"Application security requirements","85":"Secure systems architecture and engineering principles","86":"Secure coding","87":"Security testing in development and acceptance","88":"Outsourced development","89":"Separation of development, test and production environments","90":"Change management","91":"Test information","92":"Protection of information systems during audit testing"},"Compliance":{"0":"✅","1":"✅","2":"✅","3":"✅","4":"✅","5":"✅","6":"✅","7":"✅","8":"✅","9":"✅","10":"✅","11":"✅","12":"✅","13":"✅","14":"✅","15":"✅","16":"✅","17":"✅","18":"✅","19":"✅","20":"✅","21":"✅","22":"✅","23":"✅","24":"✅","25":"✅","26":"✅","27":"✅","28":"✅","29":"✅","30":"✅","31":"✅","32":"✅","33":"✅","34":"✅","35":"✅","36":"✅","37":"✅","38":"✅","39":"✅","40":"✅","41":"✅","42":"✅","43":"🟡","44":"✅","45":"✅","46":"✅","47":"✅","48":"🟡","49":"🟡","50":"✅","51":"✅","52":"🟡","53":"✅","54":"✅","55":"🟡","56":"✅","57":"✅","58":"✅","59":"✅","60":"✅","61":"✅","62":"✅","63":"✅","64":"✅","65":"✅","66":"✅","67":"✅","68":"✅","69":"🟡","70":"🟡","71":"✅","72":"🟡","73":"✅","74":"✅","75":"✅","76":"✅","77":"✅","78":"✅","79":"✅","80":"✅","81":"✅","82":"✅","83":"✅","84":"✅","85":"✅","86":"✅","87":"✅","88":"✅","89":"✅","90":"✅","91":"✅","92":"❌"},"Policy":{"0":"The Information Security Policy document defines baseline control measures, scope, enforcement, and responsibilities. It is approved by the director and reviewed yearly by ISSC and ISWG. It covers confidentiality, compliance expectations, and management oversight.","1":"Roles and responsibilities are clearly defined for CEO, ISSC, ISWG, Operational Directors, IT Asset Managers, Managers, Users, and Executive responsibilities. Segregation of duties is mandated. Competences are described for each role.","2":"Segregation of duties is required when assigning responsibilities to reduce risk of misuse. Where segregation is difficult, compensating controls like monitoring and audit trails are recommended.","3":"Management is responsible for setting security objectives, aligning with business strategy, resource management, policy setting, training, review, and continuous security. ISSC and ISWG conduct reviews and approve changes. Incident management and improvement processes are defined.","4":"Procedures exist for contacting local government security authorities and law enforcement in case of incidents. Contact details and responsibilities are defined in the Business Continuity Plan and Incident Response Plan.","5":"The organisation regularly receives security news from external vendors, forums, newsletters, and magazines to stay updated on threats and vulnerabilities.","6":"The organisation subscribes to vulnerability and virus breakout notification mechanisms and circulates relevant information to support teams. Security news is regularly obtained from external sources.","7":"Project plans and changes are reviewed by ISSC and ISWG for compliance with security policy. Change management procedures are documented and enforced. SDLC policies and quality checks are defined for software development.","8":"IT Asset Managers maintain and periodically update inventories of hardware, software, and information assets. Physical inventory checks are performed annually.","9":"Acceptable use policies are defined in the Information Technology Acceptable Usage Policy. Users are responsible for proper use of IT resources. Misuse results in disciplinary action.","10":"Procedures exist for return of company assets upon termination of employment. Borrowed equipment must be returned latest on last day of employment.","11":"Information classification schemes are established based on value, legal requirements, and handling caution. Asset owners classify and manage information assets accordingly.","12":"Information must be labelled and handled according to classification schemes. Guidelines for labelling and handling are provided in appendices.","13":"Electronic messaging and information transfer are controlled and protected according to classification. External communication requires prior approval. Incident response and communication plans are defined.","14":"Access control policies are defined and enforced. User registration, de-registration, and access restrictions are formalized. Privileged access is controlled and audited.","15":"User identities are uniquely assigned, managed, and revoked upon termination. Common and anonymous IDs are controlled. Identity verification is required for password resets.","16":"Password policies enforce secrecy, complexity, change requirements, and secure handling. Two-factor authentication is employed where possible.","17":"Access rights are assigned based on business needs and security requirements. Privileged access is restricted and reviewed periodically. Access is revoked upon termination.","18":"Contracts and SLAs with external service providers are required. Credentials and references are verified. Access is authorized and limited. Security policies are communicated and enforced with suppliers.","19":"Supplier agreements and contracts must include security requirements; contracts must be approved and managed by responsible persons; security clauses and awareness of security policies are included.","20":"Supplier credentials must be verified; NDA agreements required; security policy awareness for suppliers; key IT suppliers list maintained and reviewed annually.","21":"Periodic reviews of supplier performance based on SLA metrics, quality, timeliness, compliance, and security posture; contract management responsibilities assigned; change management procedures in place.","22":"Use of cloud services must be approved by IT-Manager and ISWG; access restricted per access control policies; cloud applications must use TLS 1.2 or higher; annual security testing of TLS.","23":"Incident management procedures established including monitoring, detection, analysis, reporting; IT Security function responsibilities defined; incident classification and reporting; CAPA forms and evidence collection; ISSC involvement.","24":"Procedures for assessment and classification of events as incidents; decision-making roles defined; incident analysis and cause identification; reporting to authorities and ISSC.","25":"Incident response procedures including containment, eradication, recovery; roles and responsibilities defined; communication plans; emergency actions documented and reviewed.","26":"Incident analysis and root cause identification; CAPA forms used; lessons learned incorporated; annual simulations recommended; ISSC reviews incidents and corrective actions.","27":"Evidence collection procedures defined; audit trails and logs maintained; incident records kept in issue tracking tools; evidence used for analysis and reporting.","28":"Business Continuity Plan defines management of incidents and recovery; Incident Response Plan and Disaster Recovery Plan included; roles and responsibilities for crisis management defined; communication plans established.","29":"Business Continuity Plan includes IT infrastructure and service recovery plans; recovery time objectives defined; resources and responsibilities assigned; restoration and resumption steps detailed.","30":"Information Security Policy scope includes compliance with legal and contractual requirements; GDPR compliance addressed; contracts and SLAs include legal requirements; regular reviews and updates performed.","31":"Procedures to ensure compliance with intellectual property rights; respect for software licensing; inventory of software maintained; copyright infringement risks acknowledged.","32":"Information disposal must be secure; personnel information must be shredded or overwritten per law; media disposal procedures defined and authorized; backups and records protected.","33":"Privacy and PII protection ensured per legislation; GDPR compliance; data incidents reported and discussed; processing agreements signed; data leaks process established.","34":"Annual internal and external ISO 27001 audits required; ISSC and ISWG conduct reviews; security organisation reviewed yearly; audit results reported and corrective actions taken.","35":"Policies and standards established and enforced; disciplinary processes for non-compliance; management reviews; training and awareness programs; monitoring and reporting of compliance.","36":"Operating procedures documented and maintained; changes authorized by management; procedures cover incident management, change management, backup, recovery, and other operational controls.","37":"Background verification and competence checks for all candidates; security tests for developers; documented screening process; compliance with laws and proportional to business needs.","38":"The Information Security Policy details screening, background checks, and employment terms including return of company assets at termination. It defines responsibilities and expectations for employees and contractors.","39":"All employees and relevant contractors must receive appropriate awareness, education, and training on organizational policies and procedures related to their job function.","40":"Failure to comply with the Information Security Policy or related rules may result in disciplinary action including termination of employment.","41":"Access to information systems and physical access must be removed on the last day of employment. Company assets must be returned. Documented processes exist for termination and role changes.","42":"All external service providers must sign NDAs or have equivalent confidentiality clauses. Employee NDAs required by third parties must be approved per company policy.","43":"Remote access to computers and mobile devices requires IT department approval. Employees (except Studio Department) can work from home in the cloud. Mobile device policies exist.","44":"Users must report all security violations immediately to managers or ISWG. Incident management procedures and reporting channels are established.","45":"Physical access is controlled by card swipe systems and personal keys. Buildings have central alarm systems with yearly code changes. Access to system racks and rooms is restricted and locked.","46":"Access to buildings and secure areas is controlled via card swipe, keys, and escorting of visitors. Emergency access procedures exist.","47":"System racks and rooms are locked by default. Higher security levels can be implemented on request. Keys are signed for and returned upon personnel leaving.","48":"The document mentions alarm systems per floor with yearly code changes but does not explicitly describe monitoring such as CCTV or intrusion detection.","49":"The document states use of local country regulations for protection against natural disasters and malicious attacks but lacks detailed controls or environmental safeguards.","50":"Access to secure areas is restricted to authorized personnel only. Visitors and uninducted staff must be escorted at all times.","51":"Clear desk policy is recommended. Personal information and critical information must not be left unattended. Lockable storage is advised. Regular internal audits are performed.","52":"Equipment usage and return policies exist. Asset management includes inventory and physical location tracking. However, specific siting and protection measures are not detailed.","53":"Policies exist for mobile device usage, asset removal, and endpoint security. Borrowed equipment must be returned at termination. Portable storage device use is discouraged and monitored.","54":"Storage media must be securely handled, labelled, and disposed of. Media disposal procedures ensure data recovery is not possible. Regular audits and controls on portable storage devices are in place.","55":"Business Continuity Plan lists required utilities and responsible persons but lacks detailed controls on utility support systems (e.g., power, HVAC) for security.","56":"Cabling such as UTP, phone cables, optical fiber, and electrical wires are installed and secured per local or European regulations.","57":"Section 6.9.38 states that any devices in the network perimeter should have regular maintenance and software updates as required or recommended by the supplier.","58":"Section 6.8.8 details secure destruction of information storage media ensuring data recovery is not possible, including physical destruction and retention of evidence. Section 6.11.5 states employees are not allowed to dispose of hardware\/software without formal approval.","59":"Section 2.1.2 Equipment usage defines documented procedures for borrowing company laptops and devices, and return upon termination. Section 5.1.11 Mobile equipment usage outlines protection and usage policies for mobile devices including encryption and software updates.","60":"Section 5.3 Management of privileged access rights restricts assignment of privileged access based on minimum business need, requires authorization and record keeping, and separation of privileged IDs from regular user IDs.","61":"Section 5.2 Information access restriction enforces access control on a need-to-know basis aligned with business requirements and classification. Formal user registration and de-registration processes are defined in Section 5.1.","62":"Section 8.1.8 states access control should be implemented to restrict access to the program source library. Section 8.1.17 requires development code stored in secure repositories enforcing access control and segregation of duties.","63":"Section 4.1 mandates password confidentiality, complexity, and secure storage. Section 7.1 and 7.2 define unique user IDs, password policies, two-factor authentication, session timeouts, and account lockout after failed attempts.","64":"Section 3.3.1 and 3.3.2 of Business Continuity Plan define recovery time objectives and resource requirements ensuring capacity for critical activities. Section 3.3 Developing action plans includes resource planning.","65":"Section 6.6 mandates installation and maintenance of antivirus software, prohibits unauthorized software, requires real-time scanning, and defines virus incident handling procedures.","66":"Section 6.2 defines a vulnerability management process including acquisition of vulnerability info, identification, evaluation, testing, and deployment of patches with documented procedures.","67":"Section 6.3 requires documented design and configuration of key IT systems, annual reviews, and updates upon significant changes. Section 6.9.35 mandates backups of network device configurations before and after changes.","68":"Section 9.3.2 mandates shredding or irretrievable overwriting of personnel information in compliance with EU law. Section 6.8.8 requires destruction of storage media ensuring data recovery is impossible.","69":"Section 8.1.10 recommends use of anonymised or pseudonymised data in testing environments and removal of test data before production deployment.","70":"Section 4.1.3 mentions yearly review of files shared externally and cleanup procedures to prevent data breaches. Section 5.1.4 restricts unauthorized file sharing and mandates reporting of security violations.","71":"Section 6.8 defines backup policies including frequency, retention, secure storage, off-site backups, testing, disposal, and restoration drills with documented procedures and responsibilities.","72":"Business Continuity Plan defines recovery sites and alternative sites for critical activities with recovery time objectives, implying redundancy. However, explicit redundancy controls for processing facilities are not detailed.","73":"Section 6.14 Logging and Audit Policy mandates synchronized clocks, logging of all access from vendors and internal users, secure storage and backup of logs, and restrictions on sensitive data in logs.","74":"Section 9.1 defines management procedures for information security incidents including monitoring, detection, analysis, reporting, assessment, and handling. Section 6.5 details incident management responsibilities and procedures.","75":"All computing systems managed must synchronise time with a central time server to ensure accuracy of audit logs.","76":"Privileged utility programs or software should be approved by the IT department or system administrator; laptops\/desktops have no administrator privileges enabled.","77":"Users may not load any software not provided by Reducate’s or group companies IT-department; only licensed software owned by Reducate or Group Companies is allowed.","78":"Network security is maintained by use of firewalls, access control, logging, encryption for data over public networks, and regular patching of network devices.","79":"Network services are secured by firewall rules, access restrictions, and monitoring; remote access requires approval and secure channels.","80":"Company network is logically separated with firewalls to prevent unauthorized access from public or wireless networks.","81":"Web group filtering or URL filtering is implemented on firewalls, routers or switches to block web traffic and protect against threats.","82":"Use of encryption for HDDs (Bitlocker, Filevault, Ecryptfs), VPNs (IPSec with 3DES or AES-256), wireless networks (WPA\/WPA2), and TLS 1.2+ for cloud\/web applications.","83":"Documented SDLC policies and procedures exist for in-house and outsourced development; quality checks and reviews are performed; contracts include licensing and IP rights.","84":"Security requirements identified and agreed prior to development; input validation and audit trails implemented; encryption and privacy maintained in applications.","85":"Systems are hardened before commissioning; unnecessary services removed; access restricted by IP and secure channels; configuration documented and reviewed.","86":"Code is reviewed by skilled personnel other than the author; secure coding guidelines followed; code stored in secure repositories with access control and versioning.","87":"Application security testing performed manually and automatically; PEN-tests conducted annually; acceptance criteria defined and tested; test environments separated and use anonymised data.","88":"Outsourced development contracts include licensing, code ownership, IP rights; external providers must comply with security policies; credentials and references verified.","89":"Development, test, and production environments are separated with restricted access; test data is anonymised; unused test environments reviewed and removed periodically.","90":"Changes to systems and software are controlled via documented change management process including review, approval, testing, and communication.","91":"Test environments use limited, anonymised or pseudonymised data; production data is not used for testing; test data removed before production deployment.","92":"No explicit policy or procedure found regarding protection of information systems during audit testing."},"Reference":{"0":"Information Security Policy [Internal].docx - Sections: Confidentiality Statement, Chapter 1 General, Section 1.1 Scope, Section 1.4 Enforcements, Chapter 10 Evaluation and Improvement (Section 10.1 Review of information security).","1":"Information Security Policy [Internal].docx - Section 1.5 Roles and Responsibilities; Section 2.1.1 Security Organisation Policy; Section 2.2 ISSC; Section 2.3 ISWG.","2":"Information Security Policy [Internal].docx - Section 1.5 Roles and Responsibilities; Chapter 6 System Management - Section 6.4 Segregation of Duties.","3":"Information Security Policy [Internal].docx - Section 1.5 Roles and Responsibilities; Chapter 9 Management of Information Security Incidents; Chapter 10 Evaluation and Improvement.","4":"Information Security Policy [Internal].docx - Section 2.1.7; Business Continuity Plan E-WISE [Restricted].pdf - Appendix 1 Incident Response Plan (pages 11-13).","5":"Information Security Policy [Internal].docx - Section 2.1.7 Security Organisation Policy.","6":"Information Security Policy [Internal].docx - Section 6.5 Security incident management; Section 2.1.7 Security Organisation Policy.","7":"Information Security Policy [Internal].docx - Section 2.1.5; Chapter 6 IT Operations Controls (6.2 Change Management); Chapter 8 Systems Development Policy.","8":"Information Security Policy [Internal].docx - Section 1.5 Roles and Responsibilities; Chapter 6.11 Asset Management.","9":"Information Security Policy [Internal].docx - Chapter 5 Personnel Security - Section 5.1 Information Technology Acceptable Usage Policy.","10":"Information Security Policy [Internal].docx - Section 2.1.2 Equipment usage; Section 2.4 Termination of employment.","11":"Information Security Policy [Internal].docx - Chapter 3 Management of Information - Section 3.1 Classification of information; Chapter 4 Asset Classification and Control.","12":"Information Security Policy [Internal].docx - Chapter 3 Management of Information - Section 3.2 Labelling and handling of information; Appendix 4 Asset Classification and Control.","13":"Information Security Policy [Internal].docx - Chapter 7 Security of Communication - Section 7.3 Electronic messaging; Business Continuity Plan E-WISE [Restricted].pdf - Appendix 1 Incident Response Plan.","14":"Information Security Policy [Internal].docx - Chapter 5 Access Control; Chapter 7 Access Control policy.","15":"Information Security Policy [Internal].docx - Chapter 5 Access Control - Section 5.1 User registration and de-registration; Chapter 7 Access Control policy - Section 7.1 Authentication.","16":"Information Security Policy [Internal].docx - Chapter 4 Management of Computers and Information Equipment - Section 4.1 Use of secret authentication information; Chapter 7 Access Control policy - Section 7.3 Password Policy; Section 7.2 Authorisation and Access Control.","17":"Information Security Policy [Internal].docx - Chapter 5 Access Control - Section 5.2 Information access restriction; Chapter 7 Access Control policy - Section 7.2 Authorisation and Access Control; Section 7.4 User Access Management.","18":"Information Security Policy [Internal].docx - Chapter 3 Business partnership and Outsourcing; Business Continuity Plan E-WISE [Restricted].pdf - Appendix 5 Key Contacts.","19":"Section 3.1 Business Partnership Security and 3.3 Business Partnership Contracts in Information Security Policy [Internal].docx: 'Reducate and group companies must have contracts and service level agreements (SLA) with outsourced service partners...'; 'A clause acknowledging and agreeing to comply with the security policy should be considered for inclusion in the contract'; 'Contract Management - A responsible and experienced person... should be allocated the responsibility of managing the contract on an ongoing basis.'","20":"Section 3.1 Business Partnership Security and 3.2 Non-Disclosure Agreements in Information Security Policy [Internal].docx: 'Credentials of potential External Service Providers must be verified before entering into a contract'; 'All External Service Providers must sign a Non-Disclosure Agreement'; 'A list of Key IT-suppliers should be maintained and yearly be checked and updated before your management review.'","21":"Section 3.3.2 Contract Management in Information Security Policy [Internal].docx: 'Periodic reviews on the performance and taking required steps to ensure quality of performance. Indicators to review the performance of external vendors are service level agreement (SLA) metrics, quality of deliverables, timeliness, communication and collaboration, compliance with regulatory requirements and security posture.'; Section 2.1.3 Change Management references.","22":"Section 7.5 Guideline for Usage of Public Cloud Services and Section 10 Cryptography in Information Security Policy [Internal].docx: 'Use of any Cloud based applications and\/or services must be approved by IT-Manager and ISWG.'; 'Access to all cloud services which the Company has approved for use must be restricted in accordance with the Company’s access control policies'; 'Any cloud application or owned (web)application should have a minimum of TLS 1.2 or higher.'; 'Yearly test TLS and security at https:\/\/www.ssllabs.com\/ssltest\/.'","23":"Chapter 9 Management of Information Security Incidents and Section 6.5 Security incident management in Information Security Policy [Internal].docx: 'Management procedures for information security incidents must be prepared'; 'Security Incident management responsibilities and procedures should be established'; 'All significant security incidents should be briefed to Reducate ISSC on a monthly basis'; 'CAPA forms should be used to describe this analysis'; 'All evidence of steps in the process of analysing and resolving a security incident or ISMS task is captured in the issue tracking tool.'","24":"Chapter 9 Section 9.1 Responsibilities and procedures and Section 6.5 Security incident management in Information Security Policy [Internal].docx: 'Procedures for assessment and decision of information security events are to be classified as information security incident'; 'IT Security function should have procedures to analyse and identify the cause of the reported incidents'; 'All significant security incidents should be briefed to Reducate ISSC on a monthly basis.'","25":"Section 6.5 Security incident management in Information Security Policy [Internal].docx: 'Security Incident management responsibilities and procedures should be established to ensure a quick, effective and orderly response'; 'All emergency actions taken to curtail or recover from the security breaches should be documented and reviewed with ISSC or ISWG.'; Incident Response Plan in Business Continuity Plan E-WISE [Restricted].docx.pdf Appendix 1.","26":"Section 6.5 Security incident management in Information Security Policy [Internal].docx: 'IT Security function should have procedures to analyse and identify the cause of the reported incidents. CAPA forms should be used'; 'A yearly simulation could help to learn and effectively remedy crisis situations'; 'All emergency actions taken... should be documented and reviewed with ISSC or ISWG.'","27":"Section 6.5 Security incident management in Information Security Policy [Internal].docx: 'All evidence of steps in the process of analysing and resolving a security incident or ISMS task is captured in the issue tracking tool in the issue record to ensure analysis, reporting and reconstruction of the event.'","28":"Business Continuity Plan E-WISE [Restricted].docx.pdf: 'The purpose of the Business Continuity Plan is to define precisely how E-WISE will manage incidents in the case of a disaster or other disruptive incident, and how it will recover its activities within set deadlines.'; 'Incident Response Plan', 'Disaster Recovery Plan', 'Recovery plans for individual activities'; 'Crisis Management Team and Support Team roles defined'; 'Communication means and responsibilities defined.'","29":"Business Continuity Plan E-WISE [Restricted].docx.pdf: 'Disaster Recovery Plan and recovery plans for particular activities'; 'Recovery time objectives for activities'; 'Resources required for recovery listed'; 'Steps for restoration and resuming business activities'; 'Command Centre equipped for crisis management.'","30":"Section 1.1 Scope of the policy and Section 5.1.1 Data Protection in Information Security Policy [Internal].docx: 'These rules apply to all employees and dispatched workers... in the case of outsourcing, the security management level required by this policy is to be ensured.'; 'We follow European laws and guidelines and comply with the GDPR law applicable as of May 25th, 2018.'; 'With all customers we sign a processing agreement.'; 'A list of Legal, Regulatory, Contractual and Other Requirements' referenced in Business Continuity Plan.","31":"Section 9.1 Intellectual Property Rights in Information Security Policy [Internal].docx: 'Appropriate procedures must be implemented to ensure compliance with legal restrictions on the use of material in respect of which there may be intellectual property rights such as copyright'; 'All Employees and contractors must respect the licensing agreements of software used'; 'IT-Department maintains an inventory of software purchased.'","32":"Section 9.3 Information Disposal in Information Security Policy [Internal].docx: 'Information disposal must be done through secure means'; 'All copies of personnel information, whether electronic or hard copy, must be shredded or irretrievably overwritten in accordance with EU law'; 'Media Disposal – All information storage media containing company information classified as ‘Internal’, ‘Confidential’ or ‘Restricted’, must be destroyed, ensuring data recovery is not possible.'","33":"Section 3.3 Privacy and protection of personally identifiable information and Section 5.1.1 Data Protection in Information Security Policy [Internal].docx: 'Privacy and protection of personally identifiable information (PII) must be ensured as required relevant legislation and regulations'; 'We follow European laws and guidelines and comply with the GDPR law applicable as of May 25th, 2018'; 'A dataleaks process, processing agreement and processing index is required'; 'Data incidents, new or changed GDPR laws and regulations and its improvements should be discussed and reported by a formal meeting on a half year basis.'","34":"Section 8.2 Application development PEN-test & audits in Information Security Policy [Internal].docx: 'An yearly ISO internal and external audit is required for every group company to comply with ISO 27001 and this information security policy'; Section 2.1.2 Security Organisation Policy: 'The global security organisation should be reviewed yearly by the Information Security Steering Committee (ISSC)'; 'The group company security organisation should be reviewed yearly by the security working group.'","35":"Information Security Policy [Internal].docx: 'It is the responsibility of all individuals (Employees and Contractors) at Reducate to comply with these policies'; 'Failure to comply with this Information Security Policy or any rules related to it may result in disciplinary action'; 'Executive responsibilities include: Carry out training and awareness programs, Review all activities, Organise the implementation, Ensure continuous information security'; 'All security violations of the Information Security Policy noticed by a user should be reported immediately to the manager and\/or ISWG.'","36":"Section 6.1 Documented Operating procedures in Information Security Policy [Internal].docx: 'The operating procedures identified by the security policy should be documented and maintained'; 'Operating procedures should be treated as formal documents and changes authorised by the management'; 'The documented procedures should include: Incident management, problem management, change management, system restart and recovery procedures, application release management, support contact and contract details, updated inventory with owner details, backup and restoration procedures, data centre management and safety.'","37":"Section 2.1 Screening in Information Security Policy [Internal].docx: 'A good control covers background verification and competence checks on all candidates for employment'; 'Background checks (Curriculum Vitae)'; 'Developers are required to do a security test via Testdome.com invited by the CTO'; 'Additional 1 former work reference could be checked'; 'Additional a “certificate of conduct” (VOG) could be required.'","38":"Information Security Policy [Internal].docx - Chapter 2 Human Resource Security, Section 2.1 Screening; Section 2.4 Termination of employment; Section 1.5 Roles and Responsibilities","39":"Information Security Policy [Internal].docx - Chapter 2 Human Resource Security, Section 2.2 Information security awareness, education and training","40":"Information Security Policy [Internal].docx - Chapter 2 Human Resource Security, Section 2.3 Disciplinary process; Section 9.4 Non-Compliance","41":"Information Security Policy [Internal].docx - Chapter 2 Human Resource Security, Section 2.4 Termination of employment; Section 2.5 Change of employment","42":"Information Security Policy [Internal].docx - Section 3.2 Non-Disclosure Agreements","43":"Information Security Policy [Internal].docx - Chapter 8 Mobile Computing (Telecommuting), Section 8.1 Mobile device policy; Business Continuity Plan E-WISE - Appendix 4 Transportation Plan; Section 6.9 Network Security Policy, 6.9.14","44":"Information Security Policy [Internal].docx - Section 5.1.4 IT Security; Chapter 9 Management of Information Security Incidents, Section 9.1 Responsibilities and procedures; Chapter 6.5 Security incident management","45":"Information Security Policy [Internal].docx - Section 7.6 Physical Access, 7.6.1 to 7.6.6","46":"Information Security Policy [Internal].docx - Section 7.6 Physical Access, 7.6.2, 7.6.8, 7.6.9, 7.6.10","47":"Information Security Policy [Internal].docx - Section 7.6 Physical Access, 7.6.3, 7.6.5, 7.6.6","48":"Information Security Policy [Internal].docx - Section 7.6 Physical Access, 7.6.1","49":"Information Security Policy [Internal].docx - Section 7.6.12","50":"Information Security Policy [Internal].docx - Section 7.6 Physical Access, 7.6.4, 7.6.9","51":"Information Security Policy [Internal].docx - Section 5.2 General Security policy, 5.2.4 Clear desk is recommended","52":"Information Security Policy [Internal].docx - Chapter 2 Human Resource Security, Section 2.1.2 Equipment usage; Chapter 6 IT Operations Controls, Section 6.11 Asset Management","53":"Information Security Policy [Internal].docx - Chapter 2 Human Resource Security, Section 2.4 Termination of employment; Chapter 4 Management of Computers and Information Equipment, Section 4.2 Removal of assets; Chapter 6 IT Operations Controls, Section 6.10 End-point Security Policy","54":"Information Security Policy [Internal].docx - Chapter 4 Management of Information, Section 4.1 Classification of information; Chapter 6 IT Operations Controls, Section 6.8 Backup & Restoration Policy; Section 6.10 End-point Security Policy","55":"Business Continuity Plan E-WISE [Restricted].docx.pdf - Section 2.9 Required resources","56":"Information Security Policy [Internal].docx - Section 6.9 Network Security Policy, 6.9.37 Cabling security","57":"Information Security Policy [Internal].docx - Section 6.9.38: \"Any devices in the perimeters of our network should have regular maintenance and software updates if this is required or recommended by the supplier.\"","58":"Information Security Policy [Internal].docx - Sections 6.8.8 and 6.11.5: \"All information storage media... must be destroyed, ensuring data recovery is not possible... Evidence of media destruction should be retained.\" and \"Employees are not allowed to dispose of hardware and software and take business belongings offside our offices without formal approval from the ISCC.\"","59":"Information Security Policy [Internal].docx - Sections 2.1.2 and 5.1.11: \"Any laptop... can be borrowed and a documented procedure should be in place.\" and \"Laptops and other mobile devices should not be left unattended... If left in a car, laptops & mobile devices should always be locked in the boot...\"","60":"Information Security Policy [Internal].docx - Section 5.3: \"The assignment of privileged access rights... must be restricted and controlled by an authorization process... Assigning privileged access rights based on the minimum requirement for the users’ business roles... Maintaining the authorization processes and records... Assigning privileged access rights to user IDs different from those used for regular business activities.\"","61":"Information Security Policy [Internal].docx - Section 5.2: \"Access to individual information and information systems must be controlled with the access control policy in accordance with a 'need-to-know' basis...\" and Section 5.1 User registration and de-registration.","62":"Information Security Policy [Internal].docx - Sections 8.1.8 and 8.1.17: \"Access control should be implemented to restrict access to the program source library.\" and \"Development code is stored in a secure code repository that enforces and meets the requirements of the access control policy and segregation of duty.\"","63":"Information Security Policy [Internal].docx - Sections 4.1, 7.1, 7.2, and 7.3: \"Keep secret authentication information confidence...\"; \"All users must be assigned unique user-IDs...\"; \"Two-factor authentication mechanism for user access...\"; \"Password selection policy with minimum length and complexity...\"","64":"Business Continuity Plan E-WISE [Restricted].docx.pdf - Sections 3.3 and 2.7: \"Activities must be recovered in the following order with defined recovery time objectives...\" and \"Each responsible person must develop an action plan... required human resources...\"","65":"Information Security Policy [Internal].docx - Section 6.6: \"Install and regularly update malware detection and repair software...\"; \"Users must not have the privilege to turn off or disable virus-checking systems...\"; \"All virus incidents must be reported via the IT service desk...\"","66":"Information Security Policy [Internal].docx - Section 6.2: \"Acquisition of information about vulnerability... Identification of vulnerabilities... Evaluation... Deployment...\"","67":"Information Security Policy [Internal].docx - Sections 6.3 and 6.9.35: \"The design & configuration of Key IT systems must be clearly documented...\"; \"A backup of all networking and security devices managed must be taken before and after any major configuration changes.\"","68":"Information Security Policy [Internal].docx - Sections 9.3.2 and 6.8.8: \"All copies of personnel information... must be shredded or irretrievably overwritten in accordance with EU law.\" and \"All information storage media... must be destroyed, ensuring data recovery is not possible.\"","69":"Information Security Policy [Internal].docx - Section 8.1.10 and 8.1.21: \"Test environments should only have limited data suitable to perform tests and preferable test data or anonymised data (data masking).\" and \"Personal data is never used for testing or development. If sensitive information is required it is sanitised, anonymised or pseudonymised.\"","70":"Information Security Policy [Internal].docx - Section 4.1.3: \"Asset Owners... should yearly review files shared with external parties. A cleanup procedure could be a measurement if too much information is shared outside our company.\" and Section 5.1.4: \"All file sharing should be enabled through appropriate directories... Unauthorized users must not test or attempt to compromise any information security mechanism.\"","71":"Information Security Policy [Internal].docx - Section 6.8: \"All critical business information and critical systems must be backed-up periodically... Procedures must be in place to ensure smooth restoration...\" and detailed sub-sections 6.8.1 to 6.8.14.","72":"Business Continuity Plan E-WISE [Restricted].docx.pdf - Sections 2.6 and 2.7: \"Appendix 3 – List of Business Continuity Sites specifies all provided alternative sites.\" and \"Activities must be recovered in the following order with defined recovery time objectives.\"","73":"Information Security Policy [Internal].docx - Section 6.14: \"All computing systems managed must synchronise time... All access to Information systems from Vendors... must be logged... Logs must be backed up and stored in a secure manner... No customer confidential information... must be recorded in the logs.\"","74":"Information Security Policy [Internal].docx - Section 9.1: \"Procedures for monitoring, detecting, analysing, and reporting information security events...\" and Section 6.5: \"Security Incident management responsibilities and procedures should be established to ensure a quick, effective and orderly response to security incidents.\"","75":"Section 6.14 Logging and Audit Policy, 6.14.1 Clock synchronisation - All computing systems managed must synchronise time with a central time server. (Information Security Policy [Internal].docx)","76":"Section 7.2.9 - A laptop or desktop computer used by employees are pre-installed by the IT department and there are no administrator privileges enabled. Privileged utility programs or software should be approved by the IT department or system administrator. (Information Security Policy [Internal].docx)","77":"Section 5.1.4 IT Security - Users may not load onto computers any software not provided by Reducate’s or group companies IT-department. Section 6.10 End-point Security Policy - PCs not managed by Administrators but by IT-Department personnel are only allowed to install licensed software which are owned by Reducate or Group Companies. (Information Security Policy [Internal].docx)","78":"Section 7.1 Network controls - Use of firewalls, authorization, access control, and logging. Section 6.9 Network Security Policy - detailed controls on firewalls, routers, switches, patching, access restrictions, and encryption. (Information Security Policy [Internal].docx)","79":"Section 6.9 Network Security Policy - Access to LAN\/WAN devices restricted, remote access requires approval, firewall rules drop unauthorized packets, and logging is maintained. (Information Security Policy [Internal].docx)","80":"Section 7.2 Segregation in networks - Firewalls installed and network logically separated. (Information Security Policy [Internal].docx)","81":"Section 6.9.39 Web group filtering or URL Filtering should be implemented on your firewall, routers or switches to block web traffic. (Information Security Policy [Internal].docx)","82":"Section 10 Cryptography - HDD encryption, VPN encryption standards, wireless encryption, TLS 1.2+ for cloud applications, yearly TLS testing. (Information Security Policy [Internal].docx)","83":"Section 8.1 Security in application development - documented SDLC policies, contract requirements for outsourced development, quality checks, and periodic reviews. (Information Security Policy [Internal].docx)","84":"Section 8.1.23 - Application forms and input fields ensure authentication, secrecy, privacy, and encryption. Section 8.1 Security in application development - security requirements identified at requirements phase. (Information Security Policy [Internal].docx)","85":"Section 6.12 Systems Security Policy - Unix systems hardened, minimal packages installed, remote root login restricted, IP restrictions applied, no welcome banners, change management enforced. (Information Security Policy [Internal].docx)","86":"Section 8.1.17 - Development code stored in secure repository with access control. Section 8.1.18 - Code reviewed prior to release against secure coding guidelines. (Information Security Policy [Internal].docx)","87":"Section 8.1.19-20 - Pre-production testing and annual vulnerability scans. Section 8.2 Application development PEN-test & audits - PEN-tests yearly, controlled environment, fixes timelines. Section 8.1.10 - Testing with anonymised data in separate environments. (Information Security Policy [Internal].docx)","88":"Section 8.1.2 - Licensing and IP rights agreed in contract. Section 3.1 Business Partnership Security - contracts, credentials, and compliance with security policy required. (Information Security Policy [Internal].docx)","89":"Section 8.1.14-15 - Development and test systems separated from production; access restricted. Section 8.1.10 - Test data anonymised; unused environments reviewed half-yearly. (Information Security Policy [Internal].docx)","90":"Section 6.2 Operational change control - documented change management with review, approval, test plan, communication. Section 8.1.11-13 - Program changes standardized, documented, approved, and controlled. (Information Security Policy [Internal].docx)","91":"Section 8.1.10 and 8.1.21 - Test environments use anonymised data; production data never used for testing; test data removed before production. (Information Security Policy [Internal].docx)","92":"No direct reference found in the provided documents."},"Gaps Identified":{"0":"","1":"","2":"","3":"","4":"","5":"","6":"","7":"","8":"","9":"","10":"","11":"","12":"","13":"","14":"","15":"","16":"","17":"","18":"","19":"","20":"","21":"","22":"","23":"","24":"","25":"","26":"","27":"","28":"","29":"","30":"","31":"","32":"","33":"","34":"","35":"","36":"","37":"","38":"","39":"","40":"","41":"","42":"","43":"No detailed remote working security controls or guidelines for secure remote access, monitoring, or user responsibilities are provided.","44":"","45":"","46":"","47":"","48":"No explicit mention of physical security monitoring systems like CCTV or access logging.","49":"No detailed physical or environmental threat protection measures such as fire suppression, flood protection, or environmental monitoring.","50":"","51":"","52":"No explicit controls on equipment siting (e.g., secure locations, protection from environmental hazards).","53":"","54":"","55":"No detailed documented controls for supporting utilities to ensure security and availability.","56":"","57":"","58":"","59":"","60":"","61":"","62":"","63":"","64":"","65":"","66":"","67":"","68":"","69":"No explicit formal policy or procedure for data masking beyond testing environments is described.","70":"No detailed technical controls or tools for data leakage prevention are described.","71":"","72":"No explicit documented redundancy architecture or failover mechanisms described.","73":"","74":"","75":"","76":"","77":"","78":"","79":"","80":"","81":"","82":"","83":"","84":"","85":"","86":"","87":"","88":"","89":"","90":"","91":"","92":"Lack of documented controls or procedures to protect information systems during audit testing activities."},"Recommended Action":{"0":"","1":"","2":"","3":"","4":"","5":"","6":"","7":"","8":"","9":"","10":"","11":"","12":"","13":"","14":"","15":"","16":"","17":"","18":"","19":"","20":"","21":"","22":"","23":"","24":"","25":"","26":"","27":"","28":"","29":"","30":"","31":"","32":"","33":"","34":"","35":"","36":"","37":"","38":"","39":"","40":"","41":"","42":"","43":"Develop and document comprehensive remote working policies including secure access methods, endpoint security, user responsibilities, and monitoring.","44":"","45":"","46":"","47":"","48":"Implement and document physical security monitoring controls such as CCTV, access logs, and intrusion detection systems.","49":"Develop and document detailed physical and environmental protection controls aligned with local regulations.","50":"","51":"","52":"Define and document equipment siting and protection controls to prevent damage or unauthorized access.","53":"","54":"","55":"Develop and document controls for supporting utilities including power, HVAC, and other critical infrastructure.","56":"","57":"","58":"","59":"","60":"","61":"","62":"","63":"","64":"","65":"","66":"","67":"","68":"","69":"Develop and document a formal data masking policy covering all relevant environments and use cases beyond testing.","70":"Implement and document technical data leakage prevention controls and monitoring tools.","71":"","72":"Document and implement explicit redundancy and failover controls for critical information processing facilities.","73":"","74":"","75":"","76":"","77":"","78":"","79":"","80":"","81":"","82":"","83":"","84":"","85":"","86":"","87":"","88":"","89":"","90":"","91":"","92":"Develop and document procedures to ensure information systems are protected during audit testing, including access controls, data protection, and monitoring during audits."}}