{"Control Id":{"0":"A.5.1","1":"A.5.2","2":"A.5.3","3":"A.5.4","4":"A.5.5","5":"A.5.6","6":"A.5.7","7":"A.5.8","8":"A.5.9","9":"A.5.10","10":"A.5.11","11":"A.5.12","12":"A.5.13","13":"A.5.14","14":"A.5.15","15":"A.5.16","16":"A.5.17","17":"A.5.18","18":"A.5.19","19":"A.5.21","20":"A.5.20","21":"A.5.22","22":"A.5.23","23":"A.5.24","24":"A.5.25","25":"A.5.26","26":"A.5.27","27":"A.5.28","28":"A.5.29","29":"A.5.30","30":"A.5.31","31":"A.5.32","32":"A.5.33","33":"A.5.34","34":"A.5.35","35":"A.5.36","36":"A.5.37","37":"A.6.1","38":"A.6.2","39":"A.6.3","40":"A.6.4","41":"A.6.5","42":"A.6.6","43":"A.6.7","44":"A.6.8","45":"A.7.1","46":"A.7.2","47":"A.7.3","48":"A.7.4","49":"A.7.5","50":"A.7.6","51":"A.7.7","52":"A.7.8","53":"A.7.9","54":"A.7.10","55":"A.7.11","56":"A.7.12","57":"A.7.13","58":"A.7.14","59":"A.8.1","60":"A.8.2","61":"A.8.3","62":"A.8.4","63":"A.8.5","64":"A.8.6","65":"A.8.7","66":"A.8.8","67":"A.8.9","68":"A.8.10","69":"A.8.11","70":"A.8.12","71":"A.8.13","72":"A.8.14","73":"A.8.15","74":"A.8.16","75":"A.8.17","76":"A.8.18","77":"A.8.19","78":"A.8.20","79":"A.8.21","80":"A.8.22","81":"A.8.23","82":"A.8.24","83":"A.8.25","84":"A.8.26","85":"A.8.28","86":"A.8.29","87":"A.8.30","88":"A.8.31","89":"A.8.32","90":"A.8.33","91":"A.8.34"},"Clause":{"0":"4,5","1":"4,5","2":"5","3":"5,6,9,10","4":"","5":"","6":"6","7":"7","8":"","9":"6","10":"","11":"6","12":"","13":"4,8","14":"","15":"","16":"","17":"","18":"4,8","19":"4","20":"8","21":"8","22":"8","23":"8","24":"8,10","25":"8,10","26":"8,10","27":"10","28":"","29":"","30":"4","31":"6","32":"6","33":"4","34":"5,9","35":"5,9,10","36":"","37":"7","38":"7","39":"7","40":"7","41":"7","42":"","43":"","44":"","45":"8","46":"","47":"","48":"8","49":"","50":"","51":"","52":"","53":"","54":"","55":"","56":"","57":"","58":"","59":"8","60":"","61":"8","62":"","63":"","64":"8","65":"8","66":"8","67":"8","68":"7","69":"","70":"","71":"8","72":"8","73":"9","74":"9","75":"9","76":"","77":"","78":"9","79":"","80":"","81":"9","82":"","83":"","84":"6","85":"6","86":"8","87":"","88":"6","89":"8","90":"","91":""},"Control Title":{"0":"Policies for information security","1":"Information security roles and responsibilities","2":"Segregation of duties","3":"Management responsibilities","4":"Contact with authorities","5":"Contact with special interest groups","6":"Threat intelligence","7":"Information security in project management","8":"Inventory of information and other associated assets","9":"Acceptable use of information and other associated assets","10":"Return of assets","11":"Classification of information","12":"Labelling of information","13":"Information transfer","14":"Access control","15":"Identity management","16":"Authentication information","17":"Access rights","18":"Information security in supplier relationships","19":"Managing information security in the ICT supply chain","20":"Addressing information security within supplier agreements","21":"Monitoring, review and change management of supplier services","22":"Information security for use of cloud services","23":"Information security incident management planning and preparation","24":"Assessment and decision on information security events","25":"Response to information security incidents","26":"Learning from information security incidents","27":"Collection of evidence","28":"Information security during disruption","29":"ICT readiness for business continuity","30":"Identification of legal, statutory, regulatory and contractual requirements","31":"Intellectual property rights","32":"Protection of records","33":"Privacy and protection of PII","34":"Independent review of information security","35":"Compliance with policies and standards for information security","36":"Documented operating procedures","37":"Screening","38":"Terms and conditions of employment","39":"Information security awareness, education and training","40":"Disciplinary process","41":"Responsibilities after termination or change of employment","42":"Confidentiality or non-disclosure agreements","43":"Remote working","44":"Information security event reporting","45":"Physical security perimeter","46":"Physical entry controls","47":"Securing offices, rooms and facilities","48":"Physical security monitoring","49":"Protecting against physical and environmental threats","50":"Working in secure areas","51":"Clear desk and clear screen","52":"Equipment siting and protection","53":"Security of assets off-premises","54":"Storage media","55":"Supporting utilities","56":"Cabling security","57":"Equipment maintenance","58":"Secure disposal or re‑use of equipment","59":"User endpoint devices","60":"Privileged access rights","61":"Information access restriction","62":"Access to source code","63":"Secure authentication","64":"Capacity management","65":"Protection against malware","66":"Management of technical vulnerabilities","67":"Configuration management","68":"Information deletion","69":"Data masking","70":"Data leakage prevention","71":"Information backup","72":"Redundancy of information processing facilities","73":"Logging","74":"Monitoring activities","75":"Clock synchronisation","76":"Use of privileged utility programs","77":"Installation of software on operational systems","78":"Network security","79":"Security of network services","80":"Segregation of networks","81":"Web filtering","82":"Use of cryptography","83":"Secure development life cycle","84":"Application security requirements","85":"Secure coding","86":"Security testing in development and acceptance","87":"Outsourced development","88":"Separation of development, test and production environments","89":"Change management","90":"Test information","91":"Protection of information systems during audit testing"},"Policy":{"0":"The Information Security Policy document defines baseline control measures, scope, enforcement, and responsibilities. It is approved by the director and reviewed yearly by ISSC and ISWG. It covers confidentiality, compliance expectations, and management oversight.","1":"Roles and responsibilities are clearly defined for CEO, ISSC, ISWG, operational directors, IT asset managers, managers, users, and executive responsibilities. Responsibilities include resource allocation, policy enforcement, awareness, and review.","2":"Segregation of duties is mandated to reduce risk of misuse. Where segregation is difficult, compensating controls like monitoring and audit trails are recommended. Management ensures segregation when assigning responsibilities.","3":"Management is responsible for setting security objectives, aligning with business strategy, resource management, policy setting, training, review, implementation, and continuous security. ISSC and ISWG conduct reviews and approve changes.","4":"Procedures exist for contacting local authorities in case of facility disasters, fire, water damage, and data leakage incidents. Contact details and escalation paths are documented.","5":"The organisation maintains subscriptions to vulnerability and virus outbreak notification mechanisms and regularly receives security news from external vendors, forums, newsletters, and local government security authorities.","6":"The organisation acquires and circulates information about vulnerabilities and threats promptly to relevant teams. Subscriptions to vulnerability notification mechanisms are maintained.","7":"Security requirements are identified and agreed prior to development. SDLC policies and procedures are documented and reviewed periodically. Quality checks, testing, and access controls are implemented in development projects.","8":"IT Asset Managers maintain and periodically update an inventory of hardware and software assets, including physical location and assigned users. Physical inventory checks are performed annually.","9":"Acceptable use policies are defined covering IT, email, internet, and mobile equipment usage. Users are responsible for security of their devices and must comply with usage rules. Disciplinary actions apply for violations.","10":"Procedures require return of company assets (laptops, mobile devices) upon termination of employment. Formal documented processes are in place for asset return and access removal on last day.","11":"Information classification schemes are established based on value, legal requirements, and handling caution. Asset owners classify and manage information assets accordingly.","12":"Information must be labelled and handled according to classification schemes. Guidelines for labelling and handling are provided to asset owners and designees.","13":"Electronic messaging and information transfer are protected according to classification. External electronic communications require prior approval. Procedures exist for secure transfer and handling.","14":"Access to information and systems is controlled on a need-to-know basis. Formal user registration, de-registration, and privilege management processes are in place. Two-factor authentication is employed where possible.","15":"Unique user IDs are assigned and managed formally. Reuse of user IDs is prohibited. Common or anonymous IDs are restricted and controlled with approvals.","16":"Password policies enforce secrecy, complexity, and secure handling. Passwords must not be shared or stored insecurely. Two-factor authentication is implemented where possible.","17":"Access rights are assigned based on business needs and reviewed periodically. Privileged access is restricted and controlled. Access is revoked promptly upon termination or role change.","18":"Contracts and SLAs with external service providers are required. Credentials and references are verified. Access is authorized and limited. Security policies are communicated and enforced with suppliers.","19":"Supplier credentials verification, contract formalization, NDA requirements, and ongoing contract management with external service providers.","20":"Supplier agreements include clauses on scope, deliverables, SLAs, access control, incident handling, change management, audits, data protection, and termination.","21":"Contract management responsibility assigned; periodic reviews of supplier performance based on SLAs, quality, timeliness, compliance, and security posture.","22":"Cloud service use requires approval; access restricted per company policies; cloud applications must use TLS 1.2+; annual security testing of TLS; use of approved cloud providers.","23":"Established incident management procedures covering monitoring, detection, analysis, reporting, recovery, and escalation; IT Security function responsibilities defined; incident classification and reporting to ISSC.","24":"Procedures for assessment and classification of security events as incidents; IT Security function analyses incidents and decides on actions; reporting to ISSC.","25":"Incident response procedures include containment, eradication, recovery, communication, and reporting; emergency actions documented and reviewed by ISSC\/ISWG.","26":"Use of CAPA forms for root cause analysis; yearly simulations to learn and improve; incident evidence and resolution steps recorded in issue tracking tool; ISSC reviews incidents monthly.","27":"Evidence collection procedures include audit trails, documentation of incident handling steps, and issue tracking to ensure analysis and reporting.","28":"Business Continuity Plan defines management of incidents and recovery to maintain information security during disruptions.","29":"Defined recovery time objectives for critical activities; appointed recovery managers; resources and communication channels identified; disaster recovery plans in place.","30":"Policy scope includes compliance with relevant laws and regulations; GDPR compliance explicitly addressed; contracts and processing agreements maintained.","31":"Procedures to ensure compliance with intellectual property rights; software licensing respected; inventory maintained.","32":"Information disposal through secure means; shredding and overwriting of personnel information; media disposal policy with evidence retention.","33":"Privacy and PII protection ensured per legislation; GDPR compliance; data leak processes; processing agreements with customers and vendors.","34":"Annual internal and external ISO 27001 audits required; ISSC and ISWG review security organization and policies yearly.","35":"Policies require compliance by all employees and contractors; disciplinary actions for non-compliance; management reviews; documented procedures and controls.","36":"Operating procedures documented and maintained; changes authorized by management; includes incident, change, backup, recovery, and system management procedures.","37":"Background verification and competence checks for all candidates; includes CV checks, interviews, security tests, references, and certificates as applicable.","38":"The Information Security Policy details screening, background checks, and employment terms including return of company assets at termination. It defines responsibilities of employees and contractors to comply with policies.","39":"All employees and relevant contractors must receive appropriate awareness, education, and training on organizational policies and procedures related to their job function.","40":"Failure to comply with the Information Security Policy or related rules may result in disciplinary action including termination of employment.","41":"At termination, access to information systems and physical access must be removed the same day; company assets must be returned. Change of employment is managed by documented processes.","42":"All external service providers must sign NDAs or have equivalent confidentiality clauses in contracts. Employee NDAs required by third parties must be approved per company policy.","43":"Remote access to computers and mobile devices requires IT department approval. Mobile device policies include registration, physical protection, and restrictions on private device use.","44":"Users must report all security violations immediately to managers or ISWG. Incident management procedures are established for monitoring, detecting, analyzing, and reporting security events.","45":"Physical access is controlled via card swipe systems and personal keys. System racks and rooms are secured by locked doors. Access is restricted to authorized personnel only.","46":"Physical entry is controlled by card swipe systems, personal keys, and escorting of visitors. Emergency access procedures exist.","47":"Offices and system rooms are secured with locked doors; higher security levels can be implemented on request. Keys are signed for and returned upon personnel leaving.","48":"There is mention of alarm systems per floor with codes changed yearly if possible. However, no explicit details on monitoring such as CCTV or continuous surveillance are provided.","49":"The document mentions use of local country regulations for protection against natural disasters and malicious attacks but lacks detailed controls or procedures.","50":"Access to secure areas is restricted to authorized personnel; visitors and uninducted staff must be escorted at all times.","51":"Clear desk policy is recommended; personal information and critical information should not be left unattended. Lockable storage is advised. Regular internal audits are performed.","52":"Equipment usage and return policies are defined; IT asset management includes inventory and physical location tracking. However, specific controls on equipment siting and physical protection are not detailed.","53":"Policies restrict removal of assets; company belongings must be returned at termination. Mobile device and endpoint security policies address off-premises use and protection.","54":"Storage media handling, disposal, and secure destruction policies are defined. Backup media storage and disposal procedures are documented.","55":"Mention of uninterruptible power supply (UPS) for network devices is included. No broader utilities support controls (e.g., HVAC, water, fire suppression) are detailed.","56":"Cabling installation and security comply with local and European regulations. Physical security of cabling is addressed.","57":"Section 6.9.38 states that devices in the network perimeter receive regular maintenance and software updates as recommended by suppliers.","58":"Section 6.8.8 details secure destruction of information storage media ensuring data recovery is not possible, with evidence retention. Section 6.11.4 and 6.11.5 cover proper disposal of hardware and software with formal approval.","59":"Section 2.1.2 Equipment usage defines documented procedures for borrowing company laptops and devices, and Section 5.1.11 End-point Security Policy restricts use of portable storage devices and mandates IT department control over devices. Section 5.1.11 also covers mobile device protection and usage.","60":"Section 5.3 Management of privileged access rights restricts assignment of privileged rights via formal authorization, minimum necessary rights, and separation of privileged IDs from regular user IDs.","61":"Section 5.2 Information access restriction enforces access control on a need-to-know basis aligned with business requirements and classification. Formal user registration, de-registration, and access management procedures are defined in Section 5.1 and 7.4.","62":"Section 8.1.8 mandates access control to program source libraries. Section 8.1.17 requires secure code repositories enforcing access control and segregation of duties.","63":"Section 4.1 mandates password confidentiality, complexity, and secure handling. Section 7.1 and 7.3 define unique user IDs, password policies including length, complexity, change frequency, and two-factor authentication (7.2.2).","64":"Section 3.3.1 Business Partnership Contracts includes capacity utilisation monitoring and planning. Section 6.13.13 database logs are monitored for capacity thresholds. Section 6.8 Backup & Restoration Policy includes monitoring backup storage and retention.","65":"Section 6.1 and 6.6 detail malware protection including prohibition of unauthorized software, mandatory antivirus installation and updates, real-time scanning, and incident reporting procedures.","66":"Section 6.2 defines a formal patch and vulnerability management process including acquisition, identification, evaluation, and deployment of patches with testing and approval.","67":"Section 6.3 mandates documented design and configuration of key IT systems, annual reviews, and updates upon significant changes. Section 6.9.35 requires backups of network device configurations before and after changes.","68":"Section 9.3 Information Disposal requires secure disposal of personnel information by shredding or irretrievable overwriting in compliance with EU law. Section 6.8.8 mandates destruction of storage media ensuring data recovery is impossible.","69":"Section 8.1.10 recommends use of anonymised or pseudonymised data in testing environments and removal of test data before production deployment.","70":"Section 4.1.3 mentions yearly review and cleanup of files shared externally to prevent data breaches. Section 5.1.11 and 5.1.4 restrict unauthorized sharing and require appropriate access controls.","71":"Section 6.8 Backup & Restoration Policy mandates periodic backups of critical information and systems, documented policies, secure storage, off-site backups, periodic testing, and disposal controls.","72":"Business Continuity Plan includes recovery plans and alternative sites for critical activities, implying redundancy. However, explicit technical redundancy controls for information processing facilities are not detailed.","73":"Section 6.14 Logging and Audit Policy mandates synchronized clocks, logging of all access, secure storage and backup of logs, and restrictions on sensitive data in logs.","74":"Section 9.1 Management of Information Security Incidents defines procedures for monitoring, detecting, analyzing, reporting, and handling security events and incidents.","75":"All computing systems managed must synchronise time with a central time server to ensure accuracy of audit logs.","76":"Privileged utility programs or software should be approved by the IT department or system administrator. Laptops\/desktops have no administrator privileges enabled by default.","77":"Users may not load any software not provided by the IT department. Only licensed software owned by the company is allowed. Unauthorized software installation is prohibited.","78":"Network security is maintained by firewalls, access control, logging, encryption for public networks, and monitoring. Network connectivity requires approval. Remote access is controlled and restricted.","79":"Network services are secured by firewall controls, access restrictions, patch management, and monitoring. Unused ports are disabled and access to network devices is restricted.","80":"Logical segregation of networks is implemented using firewalls to prevent unauthorized access from public or wireless networks.","81":"Web filtering or URL filtering is implemented on firewalls, routers, or switches to block web traffic and protect against threats.","82":"Encryption is used for HDDs (Bitlocker, Filevault, Ecryptfs), VPN connections (IPSec with 3DES or AES-256), wireless networks (WPA\/WPA2), and cloud applications (TLS 1.2+). Annual testing of TLS security is performed.","83":"SDLC policies and procedures are documented for in-house and outsourced development. Quality checks, contract reviews, testing, and documentation are required. Outsourced development must have licensing and IP rights agreed.","84":"Security requirements are identified and agreed prior to development. Input validation, audit trails, access control to source code, and secure coding standards are enforced.","85":"Code is reviewed by skilled personnel other than the author against secure coding guidelines. Development code is stored in secure repositories with access control and versioning.","86":"Application security testing is performed manually and automatically before acceptance. PEN-tests are conducted annually or after significant changes. Testing uses anonymised or pseudonymised data. Test environments are separated and use limited or masked data.","87":"Outsourced development requires review of SDLC methodology, contract agreements on licensing, code ownership, and intellectual property rights. External providers must comply with security policies and PEN-testing requirements.","88":"Development, test, and production environments are separated with no shared components. Access to development and test systems is restricted. Test data is limited or anonymised.","89":"Changes to information processing facilities and systems are controlled through documented change management processes including review, approval, testing, and communication. Emergency changes are documented and approved.","90":"Test environments use limited, anonymised, or pseudonymised data. Production data is not used for testing. Unused test environments are reviewed and removed periodically.","91":"Security incident management and logging policies exist, but explicit controls for protection of systems during audit testing are not detailed."}}