{"Clause":{"0":"4","1":"4,5","2":"5","3":"5,6,9,10","4":"","5":"","6":"6","7":"7","8":"","9":"6","10":"","11":"6","12":"","13":"4,8","14":"","15":"","16":"","17":"","18":"4,8","19":"8","20":"4","21":"8","22":"8","23":"8","24":"8,10","25":"8,10","26":"8,10","27":"10","28":"","29":"","30":"4","31":"6","32":"6","33":"4","34":"5,9","35":"5,9,10","36":"","37":"7","38":"7","39":"7","40":"7","41":"7","42":"","43":"","44":"","45":"8","46":"","47":"","48":"8","49":"","50":"","51":"","52":"","53":"","54":"","55":"","56":"","57":"","58":"","59":"8","60":"","61":"8","62":"","63":"","64":"8","65":"8","66":"8","67":"8","68":"7","69":"","70":"","71":"8","72":"8","73":"9","74":"9","75":"9","76":"","77":"","78":"9","79":"","80":"","81":"9","82":"","83":"","84":"6","85":"","86":"6","87":"8","88":"","89":"6","90":"8","91":"","92":""},"Section":{"0":"A.5 (Organisational Controls)","1":"A.5 (Organisational Controls)","2":"A.5 (Organisational Controls)","3":"A.5 (Organisational Controls)","4":"A.5 (Organisational Controls)","5":"A.5 (Organisational Controls)","6":"A.5 (Organisational Controls)","7":"A.5 (Organisational Controls)","8":"A.5 (Organisational Controls)","9":"A.5 (Organisational Controls)","10":"A.5 (Organisational Controls)","11":"A.5 (Organisational Controls)","12":"A.5 (Organisational Controls)","13":"A.5 (Organisational Controls)","14":"A.5 (Organisational Controls)","15":"A.5 (Organisational Controls)","16":"A.5 (Organisational Controls)","17":"A.5 (Organisational Controls)","18":"A.5 (Organisational Controls)","19":"A.5 (Organisational Controls)","20":"A.5 (Organisational Controls)","21":"A.5 (Organisational Controls)","22":"A.5 (Organisational Controls)","23":"A.5 (Organisational Controls)","24":"A.5 (Organisational Controls)","25":"A.5 (Organisational Controls)","26":"A.5 (Organisational Controls)","27":"A.5 (Organisational Controls)","28":"A.5 (Organisational Controls)","29":"A.5 (Organisational Controls)","30":"A.5 (Organisational Controls)","31":"A.5 (Organisational Controls)","32":"A.5 (Organisational Controls)","33":"A.5 (Organisational Controls)","34":"A.5 (Organisational Controls)","35":"A.5 (Organisational Controls)","36":"A.5 (Organisational Controls)","37":"A.6 (People Controls)","38":"A.6 (People Controls)","39":"A.6 (People Controls)","40":"A.6 (People Controls)","41":"A.6 (People Controls)","42":"A.6 (People Controls)","43":"A.6 (People Controls)","44":"A.6 (People Controls)","45":"A.7 (Physical Controls)","46":"A.7 (Physical Controls)","47":"A.7 (Physical Controls)","48":"A.7 (Physical Controls)","49":"A.7 (Physical Controls)","50":"A.7 (Physical Controls)","51":"A.7 (Physical Controls)","52":"A.7 (Physical Controls)","53":"A.7 (Physical Controls)","54":"A.7 (Physical Controls)","55":"A.7 (Physical Controls)","56":"A.7 (Physical Controls)","57":"A.7 (Physical Controls)","58":"A.7 (Physical Controls)","59":"A.8 (Technological Controls)","60":"A.8 (Technological Controls)","61":"A.8 (Technological Controls)","62":"A.8 (Technological Controls)","63":"A.8 (Technological Controls)","64":"A.8 (Technological Controls)","65":"A.8 (Technological Controls)","66":"A.8 (Technological Controls)","67":"A.8 (Technological Controls)","68":"A.8 (Technological Controls)","69":"A.8 (Technological Controls)","70":"A.8 (Technological Controls)","71":"A.8 (Technological Controls)","72":"A.8 (Technological Controls)","73":"A.8 (Technological Controls)","74":"A.8 (Technological Controls)","75":"A.8 (Technological Controls)","76":"A.8 (Technological Controls)","77":"A.8 (Technological Controls)","78":"A.8 (Technological Controls)","79":"A.8 (Technological Controls)","80":"A.8 (Technological Controls)","81":"A.8 (Technological Controls)","82":"A.8 (Technological Controls)","83":"A.8 (Technological Controls)","84":"A.8 (Technological Controls)","85":"A.8 (Technological Controls)","86":"A.8 (Technological Controls)","87":"A.8 (Technological Controls)","88":"A.8 (Technological Controls)","89":"A.8 (Technological Controls)","90":"A.8 (Technological Controls)","91":"A.8 (Technological Controls)","92":"A.8 (Technological Controls)"},"Control Id":{"0":"A.5.1","1":"A.5.2","2":"A.5.3","3":"A.5.4","4":"A.5.5","5":"A.5.6","6":"A.5.7","7":"A.5.8","8":"A.5.9","9":"A.5.10","10":"A.5.11","11":"A.5.12","12":"A.5.13","13":"A.5.14","14":"A.5.15","15":"A.5.16","16":"A.5.17","17":"A.5.18","18":"A.5.19","19":"A.5.20","20":"A.5.21","21":"A.5.22","22":"A.5.23","23":"A.5.24","24":"A.5.25","25":"A.5.26","26":"A.5.27","27":"A.5.28","28":"A.5.29","29":"A.5.30","30":"A.5.31","31":"A.5.32","32":"A.5.33","33":"A.5.34","34":"A.5.35","35":"A.5.36","36":"A.5.37","37":"A.6.1","38":"A.6.2","39":"A.6.3","40":"A.6.4","41":"A.6.5","42":"A.6.6","43":"A.6.7","44":"A.6.8","45":"A.7.1","46":"A.7.2","47":"A.7.3","48":"A.7.4","49":"A.7.5","50":"A.7.6","51":"A.7.7","52":"A.7.8","53":"A.7.9","54":"A.7.10","55":"A.7.11","56":"A.7.12","57":"A.7.13","58":"A.7.14","59":"A.8.1","60":"A.8.2","61":"A.8.3","62":"A.8.4","63":"A.8.5","64":"A.8.6","65":"A.8.7","66":"A.8.8","67":"A.8.9","68":"A.8.10","69":"A.8.11","70":"A.8.12","71":"A.8.13","72":"A.8.14","73":"A.8.15","74":"A.8.16","75":"A.8.17","76":"A.8.18","77":"A.8.19","78":"A.8.20","79":"A.8.21","80":"A.8.22","81":"A.8.23","82":"A.8.24","83":"A.8.25","84":"A.8.26","85":"A.8.27","86":"A.8.28","87":"A.8.29","88":"A.8.30","89":"A.8.31","90":"A.8.32","91":"A.8.33","92":"A.8.34"},"Control Title":{"0":"Policies for information security","1":"Information security roles and responsibilities","2":"Segregation of duties","3":"Management responsibilities","4":"Contact with authorities","5":"Contact with special interest groups","6":"Threat intelligence","7":"Information security in project management","8":"Inventory of information and other associated assets","9":"Acceptable use of information and other associated assets","10":"Return of assets","11":"Classification of information","12":"Labelling of information","13":"Information transfer","14":"Access control","15":"Identity management","16":"Authentication information","17":"Access rights","18":"Information security in supplier relationships","19":"Addressing information security within supplier agreements","20":"Managing information security in the ICT supply chain","21":"Monitoring, review and change management of supplier services","22":"Information security for use of cloud services","23":"Information security incident management planning and preparation","24":"Assessment and decision on information security events","25":"Response to information security incidents","26":"Learning from information security incidents","27":"Collection of evidence","28":"Information security during disruption","29":"ICT readiness for business continuity","30":"Identification of legal, statutory, regulatory and contractual requirements","31":"Intellectual property rights","32":"Protection of records","33":"Privacy and protection of PII","34":"Independent review of information security","35":"Compliance with policies and standards for information security","36":"Documented operating procedures","37":"Screening","38":"Terms and conditions of employment","39":"Information security awareness, education and training","40":"Disciplinary process","41":"Responsibilities after termination or change of employment","42":"Confidentiality or non-disclosure agreements","43":"Remote working","44":"Information security event reporting","45":"Physical security perimeter","46":"Physical entry controls","47":"Securing offices, rooms and facilities","48":"Physical security monitoring","49":"Protecting against physical and environmental threats","50":"Working in secure areas","51":"Clear desk and clear screen","52":"Equipment siting and protection","53":"Security of assets off-premises","54":"Storage media","55":"Supporting utilities","56":"Cabling security","57":"Equipment maintenance","58":"Secure disposal or re‑use of equipment","59":"User endpoint devices","60":"Privileged access rights","61":"Information access restriction","62":"Access to source code","63":"Secure authentication","64":"Capacity management","65":"Protection against malware","66":"Management of technical vulnerabilities","67":"Configuration management","68":"Information deletion","69":"Data masking","70":"Data leakage prevention","71":"Information backup","72":"Redundancy of information processing facilities","73":"Logging","74":"Monitoring activities","75":"Clock synchronisation","76":"Use of privileged utility programs","77":"Installation of software on operational systems","78":"Network security","79":"Security of network services","80":"Segregation of networks","81":"Web filtering","82":"Use of cryptography","83":"Secure development life cycle","84":"Application security requirements","85":"Secure systems architecture and engineering principles","86":"Secure coding","87":"Security testing in development and acceptance","88":"Outsourced development","89":"Separation of development, test and production environments","90":"Change management","91":"Test information","92":"Protection of information systems during audit testing"},"Compliance":{"0":"✅","1":"✅","2":"✅","3":"✅","4":"✅","5":"✅","6":"✅","7":"✅","8":"✅","9":"✅","10":"✅","11":"✅","12":"✅","13":"✅","14":"✅","15":"✅","16":"✅","17":"✅","18":"✅","19":"✅","20":"✅","21":"✅","22":"✅","23":"✅","24":"✅","25":"✅","26":"✅","27":"✅","28":"✅","29":"✅","30":"✅","31":"✅","32":"✅","33":"✅","34":"✅","35":"✅","36":"✅","37":"✅","38":"✅","39":"✅","40":"✅","41":"✅","42":"✅","43":"✅","44":"✅","45":"✅","46":"✅","47":"✅","48":"🟡","49":"🟡","50":"✅","51":"✅","52":"🟡","53":"✅","54":"✅","55":"✅","56":"✅","57":"✅","58":"✅","59":"✅","60":"✅","61":"✅","62":"✅","63":"✅","64":"✅","65":"✅","66":"✅","67":"✅","68":"✅","69":"🟡","70":"🟡","71":"✅","72":"🟡","73":"✅","74":"✅","75":"✅","76":"✅","77":"✅","78":"✅","79":"✅","80":"✅","81":"✅","82":"✅","83":"✅","84":"✅","85":"🟡","86":"✅","87":"✅","88":"✅","89":"✅","90":"✅","91":"✅","92":"🟡"},"Policy":{"0":"The Information Security Policy document defines baseline control measures, scope, enforcement, and responsibilities. It is approved by the director and reviewed yearly by ISSC and ISWG. It covers confidentiality, compliance expectations, and management review.","1":"Roles and responsibilities are clearly defined for CEO, ISSC, ISWG, Operational Directors, IT Asset Managers, Managers, Users, and Executive responsibilities. Segregation of duties is emphasized. Responsibilities include resource allocation, policy enforcement, awareness, and review.","2":"Segregation of duties is mandated to reduce risk of misuse. Where segregation is difficult, compensating controls like monitoring and audit trails are recommended. Management ensures segregation when assigning responsibilities.","3":"Management is responsible for setting security objectives, aligning with business strategy, resource management, policy setting, training, review, implementation, and continuous security. ISSC and ISWG conduct reviews and approve changes. Disciplinary processes and termination procedures are defined.","4":"The Business Continuity Plan and Incident Response Plan include contact details and procedures for notifying local authorities (e.g., police, fire department) in case of facility disasters or security incidents.","5":"The Information Security Policy mandates that Reducate and group companies regularly receive security news from external vendors, forums, newsletters, and magazines to stay updated on latest security news and vulnerabilities.","6":"Procedures are in place to acquire and circulate information about vulnerabilities and malware outbreaks. Subscriptions to vulnerability and virus notification mechanisms are maintained and circulated to responsible teams.","7":"The Information Security Policy requires review of system development life cycle (SDLC) methodologies, documented SDLC policies, quality checks, change control, and segregation of development, test, and production environments. Code reviews and penetration testing are mandated.","8":"IT Asset Managers are responsible for classifying, managing, and maintaining an updated inventory of information assets, including hardware and software. Physical inventory checks are performed annually.","9":"Acceptable use policies are defined covering IT, email, internet, and mobile equipment usage. Users are responsible for security of their PCs and must not misuse company resources. Disciplinary actions are defined for misuse.","10":"Procedures require return of company assets (laptops, mobile phones, peripherals) upon termination of employment. Documented processes are in place for asset return and termination.","11":"Information classification schemes are established based on value, legal requirements, and handling caution. Asset owners classify and manage information assets accordingly.","12":"Information must be labelled and handled according to classification schemes. Guidelines for labelling and handling are provided in appendices.","13":"Electronic messaging and information transfer are controlled and protected according to classification. External electronic communications require prior approval. Incident response and communication plans are defined.","14":"Access control policies are defined including user registration, de-registration, access restrictions, privileged access management, and periodic audits. Two-factor authentication is mandated where applicable.","15":"Formal user registration and de-registration procedures are in place. Unique user IDs are assigned and managed. User access is controlled and audited.","16":"Password policies are defined including complexity, change requirements, storage, and reset procedures. Secret authentication information is protected and managed securely.","17":"Access rights are assigned based on business needs and security requirements. Privileged access is restricted and controlled. Access rights are revoked promptly upon termination or role change.","18":"Supplier relationships are governed by contracts and SLAs including security requirements. Credentials and references of external service providers are verified. Access is authorized and limited. NDAs are signed. Contract management and periodic reviews are mandated.","19":"Supplier agreements must be formalized through contracts including security clauses; risk assessments are performed before contract signing; contracts include scope, roles, SLAs, access control, incident handling, change management, audits, data protection.","20":"Credentials of external service providers are verified; reference customer lists required; external providers made aware of security policies; access is authorized and limited; network connectivity with external providers controlled; key IT suppliers are maintained and reviewed annually.","21":"Contract management includes allocation of responsible person for ongoing management; periodic reviews of supplier performance based on SLAs, quality, timeliness, compliance, and security posture; change management processes apply to supplier services.","22":"Use of cloud services must be approved by IT-Manager and ISWG; access restricted per access control policies; cloud storage reviewed yearly for external sharing; encryption and secure protocols required for cloud applications.","23":"Security incident management procedures established including monitoring, detection, analysis, reporting; IT Security function responsible; subscriptions to vulnerability notifications maintained; incident reporting and briefing to ISSC; CAPA forms used for analysis; emergency actions documented and reviewed.","24":"Procedures for assessment and classification of information security events as incidents; IT Security function analyses and identifies causes; decisions on incident classification and response made by designated teams.","25":"Incident response policy implemented; IT Security function manages response including containment, eradication, recovery; emergency actions documented and reviewed; communication plans defined.","26":"Post-incident reviews conducted; CAPA forms used; yearly simulations recommended; lessons learned incorporated into ISMS; ISSC reviews incidents monthly.","27":"Evidence collection procedures defined including audit trails, documentation of incident handling steps; evidence retained in issue tracking tools; communication to authorities as needed.","28":"Business Continuity Plan defines management of incidents and recovery; Crisis Management Team and Support Team roles defined; communication and recovery plans in place; recovery time objectives established.","29":"Disaster Recovery Plans for IT infrastructure and services defined; recovery managers appointed; resources and recovery time objectives specified; restoration and resumption steps documented; periodic review and testing required.","30":"Legal, regulatory, contractual requirements identified and listed; compliance with GDPR and other laws ensured; contracts include relevant clauses; regular review and updates performed.","31":"Procedures to ensure compliance with intellectual property rights including copyright, design rights, trade secrets; software licensing respected; inventory maintained.","32":"Information disposal through secure means; shredding or overwriting of personnel information; media disposal policy with evidence retention; backups and storage secured.","33":"Privacy and protection of PII ensured per relevant legislation; GDPR compliance; data incidents reported; processing agreements signed; data leaks process in place.","34":"Annual internal and external ISO audits required; ISSC and ISWG review security organisation yearly; management reviews include security policy and ISMS changes.","35":"Policies and standards established and enforced; disciplinary processes for non-compliance; management reviews; training and awareness programs; documented procedures and controls.","36":"Operating procedures documented and maintained; changes authorized by management; procedures cover incident management, change management, backup, recovery, system restart, support contacts.","37":"Background verification and competence checks performed on all candidates; includes CV checks, interviews, security tests, references, and certificates of conduct as applicable.","38":"Section 2.1 Screening details background verification and competence checks for candidates; Section 2.4 Termination of employment and Section 2.5 Change of employment describe documented processes for termination and role changes; confidentiality and compliance responsibilities are defined in the Information Security Policy.","39":"Section 2.2 mandates all employees and relevant contractors receive appropriate awareness, education, and training on organizational policies and procedures related to their job function; ongoing e-learning and training programs are referenced.","40":"Section 2.3 states failure to comply with the Information Security Policy may result in disciplinary action including termination; Section 9.4 Non-Compliance reiterates disciplinary measures for policy violations.","41":"Section 2.4 details removal of access rights and return of company assets on termination; Section 2.5 covers documented processes for role changes; access control and asset return are enforced.","42":"Section 3.2 mandates all external service providers sign NDAs or equivalent confidentiality clauses; internal confidentiality is emphasized in the Confidentiality Statement and policy.","43":"Section 6.9 Network Security Policy and Section 8 Mobile Computing address remote access controls, approval requirements, and security measures for teleworking; Business Continuity Plan supports home\/cloud working arrangements.","44":"Section 5.1.4 requires users to report security violations immediately; Section 6.5 Security incident management defines procedures for reporting and handling incidents; Incident Response Plan and Incident Log are established.","45":"Section 7.6 Physical Access describes secured building access via card swipe, key locks, alarm systems, and controlled access to server racks; perimeter security measures and zoning are defined.","46":"Section 7.6 Physical Access details card swipe systems, key control, visitor escorting, and emergency access procedures to control physical entry.","47":"Section 7.6 Physical Access includes securing offices and server rooms with locked doors and controlled access; higher security levels can be implemented on request.","48":"Section 7.6 mentions alarm systems with codes changed yearly; however, no explicit mention of CCTV or continuous monitoring is found.","49":"Section 7.6.12 references use of local country regulations for protection against natural disasters and malicious attacks; Business Continuity Plan addresses disaster recovery but lacks detailed environmental controls.","50":"Section 7.6 requires that visitors and uninducted staff be escorted in secure areas; access to server rooms is restricted to authorized personnel only.","51":"Section 5.2.4 recommends clear desk policy, destruction of critical information, and regular internal audits to ensure compliance.","52":"Section 6.11 Asset Management requires inventory and physical location tracking; Section 7.6 mentions secured racks but lacks detailed equipment siting and protection controls.","53":"Section 4.2 Equipment usage and Section 6.10 End-point Security Policy address controls for company assets used off-premises including return procedures and security requirements.","54":"Section 6.8 Backup & Restoration Policy and Section 6.10 Storage devices define secure storage, disposal, and handling of storage media including encryption and destruction.","55":"Section 6.9.36 mandates uninterruptible power supply (UPS) for network devices; Business Continuity Plan includes facilities and infrastructure recovery.","56":"Section 6.9.37 requires cabling to be installed and secured per local or European regulations.","57":"Section 6.9.38 states that any devices in the network perimeter should have regular maintenance and software updates as required or recommended by the supplier.","58":"Section 6.8.8 details media disposal procedures ensuring data recovery is not possible, including physical destruction and retention of evidence. Section 6.11.5 states employees are not allowed to dispose of hardware\/software without formal approval.","59":"Section 2.1.2 Equipment usage defines documented procedures for borrowing company laptops and devices, and Section 6.10 End-point Security Policy covers controls on mobile devices, software installation, patching, and usage restrictions.","60":"Section 5.3 Management of privileged access rights restricts assignment of privileged rights via formal authorization, minimum necessary rights, and separation of privileged IDs from regular IDs.","61":"Section 5.2 Information access restriction enforces access control on a need-to-know basis aligned with business requirements and classification. Appendix 7.4 User Access Management formalizes access control procedures.","62":"Section 8.1.8 states access control should be implemented to restrict access to the program source library. Section 8.1.17 requires development code stored in secure repositories enforcing access control and segregation of duties.","63":"Section 4.1 mandates password confidentiality, complexity, and secure storage. Section 7.1 and 7.3 detail user authentication, unique IDs, password policies including length, complexity, change frequency, and two-factor authentication (7.2.2).","64":"Section 3.3.1 in Business Continuity Plan and Section 3.3.2 in Business Partnership Contracts address capacity utilization monitoring and planning. Section 6.9.7 and 6.9.35 discuss network and system capacity monitoring and backups.","65":"Section 6.1 and 6.6 detail malware protection including prohibition of unauthorized software, installation and updating of antivirus, real-time scanning, and virus incident handling procedures.","66":"Section 6.2 defines a vulnerability management process including acquisition of vulnerability info, identification, evaluation, testing, and deployment of patches with approval and documentation.","67":"Section 6.3 requires documented design and configuration of key IT systems, annual review and updates of configuration documents, and change management controls.","68":"Section 9.3 Information Disposal mandates secure disposal of personnel information by shredding or irretrievable overwriting. Section 6.8.8 covers media disposal ensuring data recovery is impossible with evidence retained.","69":"Section 8.1.10 mentions use of anonymised or pseudonymised data in testing environments to avoid use of production or personal data.","70":"Section 4.1.3 mentions yearly review of files shared externally and cleanup procedures to prevent data leakage. Section 5.1.4 restricts unauthorized file sharing and mandates use of approved directories.","71":"Section 6.8 Backup & Restoration Policy mandates periodic backups, documented procedures, secure storage, off-site backups, testing, retention periods, and disposal controls.","72":"Business Continuity Plan defines recovery time objectives and alternative sites for critical activities, implying redundancy. However, explicit technical redundancy controls for information processing facilities are not detailed.","73":"Section 6.14 Logging and Audit Policy mandates synchronized clocks, logging of all access, secure storage and backup of logs, and restrictions on sensitive data in logs.","74":"Section 9.1 Responsibilities and procedures define management procedures for monitoring, detecting, analyzing, reporting, and handling information security incidents.","75":"All computing systems managed must synchronise time with a central time server to ensure accuracy of audit logs.","76":"Privileged utility programs or software should be approved by the IT department or system administrator; laptops\/desktops have no admin privileges enabled.","77":"Users may not load any software not provided by the IT department; only licensed software owned by the company is allowed; unauthorized software is prohibited.","78":"Network security is maintained by firewalls, access control, logging, encryption for public networks, and regular patching of network devices.","79":"Network services are secured by firewall rules, access restrictions, logging, and patch management.","80":"Logical separation of networks is enforced with firewalls to prevent unauthorized access from public or wireless networks.","81":"Web filtering or URL filtering is implemented on firewalls, routers, or switches to block web traffic and protect against threats.","82":"Encryption is used for HDDs (Bitlocker, Filevault, Ecryptfs), VPN connections (IPSec with 3DES or AES-256), wireless networks (WPA\/WPA2), and cloud applications (TLS 1.2+). Annual TLS testing is performed.","83":"SDLC policies and procedures are documented; external providers' SDLC reviewed; quality checks and periodic reviews are performed; security requirements identified early.","84":"Security requirements are identified and agreed prior to development; audit trails and access controls are implemented; privacy and encryption are incorporated in applications.","85":"System hardening and minimal package installation are mentioned for Unix systems; IP restrictions and removal of unnecessary services are applied.","86":"Code is reviewed by skilled personnel other than the author; secure coding guidelines are followed; code stored in secure repositories with access control and versioning.","87":"Application security testing is performed manually and automatically; PEN-tests are conducted annually or after significant changes; acceptance criteria and testing are documented.","88":"Outsourced development requires review of SDLC methodology; contracts must address licensing, code ownership, IP rights; security policy compliance clauses included.","89":"Development, test, and production environments are separated with no shared components; access to development and test systems is restricted.","90":"Change management is documented with strict review, approval, and closure controls; all changes including emergency changes are documented and approved; configuration management is maintained.","91":"Test environments use limited, anonymised or masked data; production data is never used for testing; test data is removed before production deployment.","92":"Audit and logging policies exist; incident management and security controls are in place; however, explicit controls for protecting systems during audit testing are not detailed."},"Reference":{"0":"Information Security Policy [Internal].docx - Sections: Confidentiality Statement, Chapter 1 General, Section 1.1 Scope of the policy, Section 1.4 Enforcements, Chapter 10 Evaluation and Improvement - Section 10.1 Review of information security","1":"Information Security Policy [Internal].docx - Section 1.5 Roles and Responsibilities, Chapter 2 Human Resource Security, Section 2.1.2 Competences operators ISMS, Chapter 2.4 Termination of employment","2":"Information Security Policy [Internal].docx - Section 1.5 Roles and Responsibilities, Chapter 6 IT Operations Controls - Section 6.4 Segregation of Duties","3":"Information Security Policy [Internal].docx - Section 1.5 Roles and Responsibilities, Chapter 2 Human Resource Security, Chapter 10 Evaluation and Improvement - Section 10.1 Review of information security, Chapter 9 Management of Information Security Incidents, Chapter 2.3 Disciplinary process, Chapter 2.4 Termination of employment","4":"Business Continuity Plan E-WISE [Restricted].docx.pdf - Appendix 1 Incident Response Plan (Page 11), Section 2.3 Appointments and authorities (Page 4-5)","5":"Information Security Policy [Internal].docx - Section 2.1.7 Management of Information security","6":"Information Security Policy [Internal].docx - Chapter 6 System Management - Section 6.2 Management of technical vulnerabilities, Section 6.5 Security incident management, Section 6.6 Protection against malicious software","7":"Information Security Policy [Internal].docx - Chapter 8 Systems Development Policy (Sections 8.1 to 8.3)","8":"Information Security Policy [Internal].docx - Section 1.5 Roles and Responsibilities, Chapter 6 IT Operations Controls - Section 6.11 Asset Management","9":"Information Security Policy [Internal].docx - Chapter 5 Personnel Security - Section 5.1 Information Technology Acceptable Usage Policy","10":"Information Security Policy [Internal].docx - Chapter 2 Human Resource Security - Section 2.4 Termination of employment","11":"Information Security Policy [Internal].docx - Chapter 3 Management of Information - Section 3.1 Classification of information","12":"Information Security Policy [Internal].docx - Chapter 3 Management of Information - Section 3.2 Labelling and handling of information","13":"Information Security Policy [Internal].docx - Chapter 7 Security of Communication - Section 7.3 Electronic messaging; Business Continuity Plan E-WISE - Appendix 1 Incident Response Plan","14":"Information Security Policy [Internal].docx - Chapter 5 Access Control (Sections 5.1 to 5.3), Chapter 7 Access Control policy (Sections 7.1 to 7.4)","15":"Information Security Policy [Internal].docx - Chapter 5 Access Control - Section 5.1 User registration and de-registration; Chapter 7 Access Control policy - Section 7.4 User Access Management","16":"Information Security Policy [Internal].docx - Chapter 4 Management of Computers and Information Equipment - Section 4.1 Use of secret authentication information; Chapter 7 Access Control policy - Section 7.3 Password Policy","17":"Information Security Policy [Internal].docx - Chapter 5 Access Control - Section 5.3 Management of privileged access rights; Chapter 7 Access Control policy - Sections 7.2 Authorisation and Access Control, 7.4 User Access Management","18":"Information Security Policy [Internal].docx - Chapter 3 Business partnership and Outsourcing (Sections 3.1 to 3.3)","19":"Section 3.3 Business Partnership Contracts: 'All outsourcing to External Service Providers must be formalised through a contract... recommended areas that need to be addressed in the contract include... access control mechanisms, IT Incident & Problem handling process, IT Change management process, periodic audits, data protection.' (Information Security Policy [Internal].docx)","20":"Section 3.1 Business Partnership Security and 3.1.1 to 3.1.9 (Information Security Policy [Internal].docx)","21":"Section 3.3.2 Contract Management: 'Periodic reviews on the performance and taking required steps to ensure quality of performance... Indicators to review the performance of external vendors are service level agreement (SLA) metrics, quality of deliverables, timeliness, communication and collaboration, compliance with regulatory requirements and security posture.' (Information Security Policy [Internal].docx)","22":"Section 7.5 Guideline for Usage of Public Cloud Services; Section 4.1.3 on cloud file sharing review; Section 10 Cryptography on TLS requirements (Information Security Policy [Internal].docx)","23":"Chapter 9 Management of Information Security Incidents; Section 6.5 Security incident management (Information Security Policy [Internal].docx); Business Continuity Plan Appendix 1 Incident Response Plan (Business Continuity Plan E-WISE.pdf)","24":"Chapter 9 Section 9.1 Responsibilities and procedures; Section 6.5.5 on analysis and identification of causes; Incident Response Plan (Information Security Policy [Internal].docx and Business Continuity Plan E-WISE.pdf)","25":"Section 6.5 Security incident management; Appendix 1 Incident Response Plan (Information Security Policy [Internal].docx and Business Continuity Plan E-WISE.pdf)","26":"Section 6.5.5 and 6.5.6 on analysis, CAPA, and review with ISSC; Business Continuity Plan on review and update (Information Security Policy [Internal].docx and Business Continuity Plan E-WISE.pdf)","27":"Section 6.5.5 on collection of evidence such as audit trails and documentation; use of issue tracking tool (Information Security Policy [Internal].docx)","28":"Business Continuity Plan E-WISE.pdf Chapters 1-4 including Incident Response Plan, Disaster Recovery Plan, communication, roles and responsibilities, recovery order and resources.","29":"Business Continuity Plan E-WISE.pdf Chapters 2-4 and Appendices 6 Disaster Recovery Plans, 3 List of Business Continuity Sites, 4 Transportation Plan; Section 3 Restoring and resuming business activities.","30":"Section 1.1 Scope and 3 Business Partnership Security; Section 5.1.1 Data Protection and GDPR compliance; Business Continuity Plan references legal and regulatory requirements (Information Security Policy [Internal].docx and Business Continuity Plan E-WISE.pdf)","31":"Section 9.1 Intellectual Property Rights and 9.2 Software Licensing (Information Security Policy [Internal].docx)","32":"Section 9.3 Information Disposal; Section 6.8 Backup & Restoration Policy; Media Disposal (Information Security Policy [Internal].docx)","33":"Section 3.3 Privacy and protection of personally identifiable information; Section 5.1.1 Data Protection and GDPR compliance; Business Continuity Plan Incident Response Plan for data leakage (Information Security Policy [Internal].docx and Business Continuity Plan E-WISE.pdf)","34":"Section 8.2.7 Annual ISO internal and external audit; Section 2 Security Organisation reviews; Chapter 10 Evaluation and Improvement (Information Security Policy [Internal].docx)","35":"Section 1.5 Roles and Responsibilities; Section 2.3 Disciplinary process; Section 2.2 Awareness and training; Chapter 10 Review of information security; Section 6.1 Documented Operating procedures (Information Security Policy [Internal].docx)","36":"Section 6.1 Documented Operating procedures (Information Security Policy [Internal].docx)","37":"Section 2.1 Screening (Information Security Policy [Internal].docx)","38":"Information Security Policy [Internal].docx - Sections 2.1 Screening, 2.4 Termination of employment, 2.5 Change of employment","39":"Information Security Policy [Internal].docx - Section 2.2 Information security awareness, education and training","40":"Information Security Policy [Internal].docx - Sections 2.3 Disciplinary process, 9.4 Non-Compliance","41":"Information Security Policy [Internal].docx - Sections 2.4 Termination of employment, 2.5 Change of employment","42":"Information Security Policy [Internal].docx - Section 3.2 Non-Disclosure Agreements; Confidentiality Statement","43":"Information Security Policy [Internal].docx - Sections 6.9 Network Security Policy, 8 Mobile Computing; Business Continuity Plan E-WISE.pdf - Section 2.7 Order of recovery for activities","44":"Information Security Policy [Internal].docx - Sections 5.1.4, 6.5 Security incident management; Business Continuity Plan E-WISE.pdf - Appendix 1 Incident Response Plan, Appendix 2 Incident Log","45":"Information Security Policy [Internal].docx - Section 7.6 Physical Access","46":"Information Security Policy [Internal].docx - Section 7.6 Physical Access","47":"Information Security Policy [Internal].docx - Section 7.6 Physical Access","48":"Information Security Policy [Internal].docx - Section 7.6 Physical Access","49":"Information Security Policy [Internal].docx - Section 7.6.12; Business Continuity Plan E-WISE.pdf","50":"Information Security Policy [Internal].docx - Section 7.6 Physical Access","51":"Information Security Policy [Internal].docx - Section 5.2 General Security policy","52":"Information Security Policy [Internal].docx - Sections 6.11 Asset Management, 7.6 Physical Access","53":"Information Security Policy [Internal].docx - Sections 2.1.2 Equipment usage, 6.10 End-point Security Policy","54":"Information Security Policy [Internal].docx - Sections 6.8 Backup & Restoration Policy, 6.10 End-point Security Policy","55":"Information Security Policy [Internal].docx - Section 6.9.36; Business Continuity Plan E-WISE.pdf - Section 2.9 Required resources","56":"Information Security Policy [Internal].docx - Section 6.9.37 Cabling security","57":"Information Security Policy [Internal].docx - Section 6.9.38: \"Any devices in the perimeters of our network should have regular maintenance and software updates if this is required or recommended by the supplier.\"","58":"Information Security Policy [Internal].docx - Sections 6.8.8 and 6.11.5: \"All information storage media... must be destroyed, ensuring data recovery is not possible... Evidence of media destruction should be retained.\" and \"Employees are not allowed to dispose of hardware and software and take business belongings offside our offices without formal approval from the ISCC.\"","59":"Information Security Policy [Internal].docx - Sections 2.1.2 and 6.10: \"Any laptop... can be borrowed and a documented procedure should be in place.\" and \"It is not allowed to install any inappropriate software... Administrators must ensure latest virus definitions and OS patches are applied.\"","60":"Information Security Policy [Internal].docx - Section 5.3: \"The assignment of privileged access rights... must be restricted and controlled by an authorization process... Assigning privileged access rights based on the minimum requirement... Assigning privileged access rights to user IDs different from those used for regular business activities.\"","61":"Information Security Policy [Internal].docx - Section 5.2: \"Access to individual information and information systems must be controlled with the access control policy in accordance with a 'need-to-know' basis...\"","62":"Information Security Policy [Internal].docx - Sections 8.1.8 and 8.1.17: \"Access control should be implemented to restrict access to the program source library.\" and \"Development code is stored in a secure code repository that enforces and meets the requirements of the access control policy and segregation of duty.\"","63":"Information Security Policy [Internal].docx - Sections 4.1, 7.1, 7.2, 7.3: \"Keep secret authentication information confidence... Select quality password with sufficient minimum length...\"; \"All users must have unique user-IDs...\"; \"Two-factor authentication mechanism for user access...\"; \"Passwords must have minimum 12 alphanumeric-symbol characters.\"","64":"Business Continuity Plan E-WISE [Restricted].docx.pdf - Appendix 3.3.1 and 3.3.2: \"Capacity utilisation monitoring and planning (if applicable)\"; Information Security Policy [Internal].docx - Section 3.3.1 and 6.9.35: \"Capacity utilisation monitoring and planning\" and \"Backup of all networking and security devices managed must be taken before and after any major configuration changes.\"","65":"Information Security Policy [Internal].docx - Sections 6.1, 6.6: \"Prohibit the use of unauthorised software... Install and regularly update malware detection and repair software... Virus incidents must be reported and treated as security incidents.\"","66":"Information Security Policy [Internal].docx - Section 6.2: \"Acquisition of information about vulnerability... Identification of vulnerabilities... Evaluation... Deployment... Apply patches to the operational environment...\"","67":"Information Security Policy [Internal].docx - Section 6.3: \"The design & configuration of Key IT systems must be clearly documented... Configuration management documents should be reviewed annually...\"","68":"Information Security Policy [Internal].docx - Sections 9.3 and 6.8.8: \"Information disposal must be done through secure means... must be shredded or irretrievably overwritten...\" and \"All information storage media... must be destroyed, ensuring data recovery is not possible.\"","69":"Information Security Policy [Internal].docx - Section 8.1.10 and 8.1.21: \"Test environments should only have limited data suitable to perform tests and preferable test data or anonymised data (data masking).\" and \"Personal data is never used for testing or development. If sensitive information is required it is sanitised, anonymised or pseudonymised.\"","70":"Information Security Policy [Internal].docx - Sections 4.1.3 and 5.1.4: \"Asset Owners should yearly review files shared with external parties...\" and \"All file sharing should be enabled through appropriate directories... sharing folders on individual computers is prohibited.\"","71":"Information Security Policy [Internal].docx - Section 6.8: \"All critical business information and critical systems must be backed-up periodically... Procedures must be in place... Backups must be stored securely... Backup media must be tested periodically...\"","72":"Business Continuity Plan E-WISE [Restricted].docx.pdf - Section 2.7: \"Activities must be recovered in the following order...\" and Appendix 3 – List of Business Continuity Sites specifying alternative sites.","73":"Information Security Policy [Internal].docx - Section 6.14: \"All computing systems must synchronise time... All access must be logged... Logs must be backed up and stored securely... No customer confidential information must be recorded in the logs.\"","74":"Information Security Policy [Internal].docx - Section 9.1: \"Management procedures for information security incidents must be prepared including procedures for monitoring, detecting, analysing, and reporting information security events...\"","75":"Section 6.14 Logging and Audit Policy, 6.14.1 Clock synchronisation - All computing systems managed must synchronise time with a central time server. (Information Security Policy [Internal].docx)","76":"Section 7.2.9 - A laptop or desktop computer used by employees are pre-installed by the IT department and there are no administrator privileges enabled. Privileged utility programs or software should be approved by the IT department or system administrator. (Information Security Policy [Internal].docx)","77":"Section 5.1.4 IT Security - Users may not load onto computers any software not provided by Reducate’s or group companies IT-department. Section 6.10 End-point Security Policy - PCs not managed by Administrators but by IT-Department personnel are only allowed to install licensed software which are owned by Reducate or Group Companies. Illegal or inappropriate software is not allowed. (Information Security Policy [Internal].docx)","78":"Section 7.1 Network controls - Use of firewalls, authorization, access control, and logging. Encryption for data over public networks. Section 6.9 Network Security Policy - detailed firewall rules, patching, access restrictions, logging, and network device management. (Information Security Policy [Internal].docx)","79":"Section 6.9 Network Security Policy - firewall management, access control, logging, patching, and configuration management. (Information Security Policy [Internal].docx)","80":"Section 7.2 Segregation in networks - firewalls installed and logical separation of company network. (Information Security Policy [Internal].docx)","81":"Section 6.9.39 Web group filtering or URL Filtering should be implemented on your firewall, routers or switches to block web traffic in order to protect against potential threats and enforce corporate or legal policies and regulations. (Information Security Policy [Internal].docx)","82":"Section 10 Cryptography - HDD encryption, VPN encryption standards, wireless encryption, cloud app TLS requirements and testing. (Information Security Policy [Internal].docx)","83":"Section 8.1 Security in application development - documented SDLC policies, review of external providers, quality checks, periodic reviews, and embedding security requirements. (Information Security Policy [Internal].docx)","84":"Section 8.1.23 - protections for authentication, transaction secrecy, privacy, encryption, and certificate management. (Information Security Policy [Internal].docx)","85":"Section 6.12 Systems Security Policy - Unix systems hardened, minimal packages installed, IP restrictions applied, unnecessary services removed. (Information Security Policy [Internal].docx)","86":"Section 8.1.17-8.1.18 - secure code repository with access control and versioning; code review prior to release against secure coding guidelines. (Information Security Policy [Internal].docx)","87":"Section 8.1.19-8.1.20 - application security testing manual and automated; PEN-tests per OWASP top 10; Section 8.2 Application development PEN-test & audits. (Information Security Policy [Internal].docx)","88":"Section 8.1.1-8.1.4 - review of external providers' SDLC; Section 3.1.5 - external providers made aware of security policy; Section 8.2.5 - ISO certifications and PEN-tests for outsourced software. (Information Security Policy [Internal].docx)","89":"Section 8.1.14-8.1.15 - development and test systems not in production; environments separated and access restricted. (Information Security Policy [Internal].docx)","90":"Section 6.2 Operational change control; 6.2.1 Change management documented; 6.3 Configuration Management; 8.1.11-8.1.13 - change requests standardized and controlled; 6.12.8 - system changes approved via change management. (Information Security Policy [Internal].docx)","91":"Section 8.1.10 and 8.1.21 - test environments have limited or anonymised data; production data not used for testing; test data removed before production. (Information Security Policy [Internal].docx)","92":"Sections 6.14 Logging and Audit Policy; 6.5 Security incident management; 8.2 PEN-tests done in controlled environments. (Information Security Policy [Internal].docx)"},"Gaps Identified":{"0":"","1":"","2":"","3":"","4":"","5":"","6":"","7":"","8":"","9":"","10":"","11":"","12":"","13":"","14":"","15":"","16":"","17":"","18":"","19":"","20":"","21":"","22":"","23":"","24":"","25":"","26":"","27":"","28":"","29":"","30":"","31":"","32":"","33":"","34":"","35":"","36":"","37":"","38":"","39":"","40":"","41":"","42":"","43":"","44":"","45":"","46":"","47":"","48":"Lack of explicit physical security monitoring controls such as CCTV or intrusion detection systems.","49":"No detailed documented controls for environmental threats such as fire suppression, flood protection, or HVAC systems.","50":"","51":"","52":"No explicit documented controls on equipment siting considerations such as protection from environmental hazards or unauthorized access beyond rack locking.","53":"","54":"","55":"","56":"","57":"","58":"","59":"","60":"","61":"","62":"","63":"","64":"","65":"","66":"","67":"","68":"","69":"No detailed policy or procedures on data masking beyond testing environments; no mention of masking in production or operational use.","70":"No explicit technical controls or tools described for data leakage prevention (DLP) such as monitoring, blocking, or alerting.","71":"","72":"No explicit documented redundancy mechanisms or configurations for IT infrastructure or processing facilities.","73":"","74":"","75":"","76":"","77":"","78":"","79":"","80":"","81":"","82":"","83":"","84":"","85":"No explicit documented secure architecture principles or formal engineering guidelines beyond Unix system hardening.","86":"","87":"","88":"","89":"","90":"","91":"","92":"No explicit documented procedures for protecting information systems specifically during audit testing."},"Recommended Action":{"0":"","1":"","2":"","3":"","4":"","5":"","6":"","7":"","8":"","9":"","10":"","11":"","12":"","13":"","14":"","15":"","16":"","17":"","18":"","19":"","20":"","21":"","22":"","23":"","24":"","25":"","26":"","27":"","28":"","29":"","30":"","31":"","32":"","33":"","34":"","35":"","36":"","37":"","38":"","39":"","40":"","41":"","42":"","43":"","44":"","45":"","46":"","47":"","48":"Implement and document physical security monitoring measures like CCTV surveillance and intrusion detection systems to enhance perimeter security.","49":"Develop and document specific physical and environmental protection controls including fire detection\/suppression, flood prevention, and environmental monitoring.","50":"","51":"","52":"Document and implement detailed equipment siting and protection controls including environmental safeguards and physical protection measures.","53":"","54":"","55":"","56":"","57":"","58":"","59":"","60":"","61":"","62":"","63":"","64":"","65":"","66":"","67":"","68":"","69":"Develop and document comprehensive data masking policies and procedures for all relevant environments beyond testing, including production and operational use.","70":"Implement and document technical DLP controls and monitoring tools to detect and prevent unauthorized data exfiltration.","71":"","72":"Document and implement explicit redundancy controls and configurations for critical information processing facilities to ensure availability.","73":"","74":"","75":"","76":"","77":"","78":"","79":"","80":"","81":"","82":"","83":"","84":"","85":"Develop and document comprehensive secure systems architecture and engineering principles covering all platforms and system types.","86":"","87":"","88":"","89":"","90":"","91":"","92":"Develop and document specific controls and procedures to protect information systems during audit and penetration testing activities."}}